MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GC006/mcu.h
#define SPI1CON1 SPI1CON1
extern volatile uint16_t SPI1CON1 __attribute__((__sfr__));
__extension__ typedef struct tagSPI1CON1BITS {
  union {
    struct {
      uint16_t PPRE:2;
      uint16_t SPRE:3;
      uint16_t MSTEN:1;
      uint16_t CKP:1;
      uint16_t SSEN:1;
      uint16_t CKE:1;
      uint16_t SMP:1;
      uint16_t MODE16:1;
      uint16_t DISSDO:1;
      uint16_t DISSCK:1;
    };
    struct {
      uint16_t PPRE0:1;
      uint16_t PPRE1:1;
      uint16_t SPRE0:1;
      uint16_t SPRE1:1;
      uint16_t SPRE2:1;
    };
  };
} SPI1CON1BITS;
extern volatile SPI1CON1BITS SPI1CON1bits __attribute__((__sfr__));

#define SPI1CON2 SPI1CON2
extern volatile uint16_t SPI1CON2 __attribute__((__sfr__));
__extension__ typedef struct tagSPI1CON2BITS {
  union {
    struct {
      uint16_t SPIBEN:1;
      uint16_t SPIFE:1;
      uint16_t :11;
      uint16_t SPIFPOL:1;
      uint16_t SPIFSD:1;
      uint16_t FRMEN:1;
    };
    struct {
      uint16_t :1;
      uint16_t FRMDLY:1;
      uint16_t :11;
      uint16_t FRMPOL:1;
    };
  };
} SPI1CON2BITS;
extern volatile SPI1CON2BITS SPI1CON2bits __attribute__((__sfr__));

#define SPI1BUF SPI1BUF
extern volatile uint16_t SPI1BUF __attribute__((__sfr__));
#define AMP1CON AMP1CON
extern volatile uint16_t AMP1CON __attribute__((__sfr__));
__extension__ typedef struct tagAMP1CONBITS {
  union {
    struct {
      uint16_t PINSEL:3;
      uint16_t NINSEL:3;
      uint16_t AMPOE:1;
      uint16_t SPDSEL:1;
      uint16_t CMPSEL:1;
      uint16_t CMOUT:1;
      uint16_t INTPOL:2;
      uint16_t AMPSLP:1;
      uint16_t AMPSIDL:1;
      uint16_t :1;
      uint16_t AMPEN:1;
    };
    struct {
      uint16_t PINSEL0:1;
      uint16_t PINSEL1:1;
      uint16_t PINSEL2:1;
      uint16_t NINSEL0:1;
      uint16_t NINSEL1:1;
      uint16_t NINSEL2:1;
      uint16_t :4;
      uint16_t INTPOL0:1;
      uint16_t INTPOL1:1;
    };
  };
} AMP1CONBITS;
extern volatile AMP1CONBITS AMP1CONbits __attribute__((__sfr__));

#define AMP2CON AMP2CON
extern volatile uint16_t AMP2CON __attribute__((__sfr__));
__extension__ typedef struct tagAMP2CONBITS {
  union {
    struct {
      uint16_t PINSEL:3;
      uint16_t NINSEL:3;
      uint16_t AMPOE:1;
      uint16_t SPDSEL:1;
      uint16_t CMPSEL:1;
      uint16_t CMOUT:1;
      uint16_t INTPOL:2;
      uint16_t AMPSLP:1;
      uint16_t AMPSIDL:1;
      uint16_t :1;
      uint16_t AMPEN:1;
    };
    struct {
      uint16_t PINSEL0:1;
      uint16_t PINSEL1:1;
      uint16_t PINSEL2:1;
      uint16_t NINSEL0:1;
      uint16_t NINSEL1:1;
      uint16_t NINSEL2:1;
      uint16_t :4;
      uint16_t INTPOL0:1;
      uint16_t INTPOL1:1;
    };
  };
} AMP2CONBITS;
extern volatile AMP2CONBITS AMP2CONbits __attribute__((__sfr__));


#define UART3 UART3
extern volatile UART UART3 __attribute__((__sfr__));

#define U3MODE U3MODE
extern volatile uint16_t U3MODE __attribute__((__sfr__));
__extension__ typedef struct tagU3MODEBITS {
  union {
    struct {
      uint16_t STSEL:1;
      uint16_t PDSEL:2;
      uint16_t BRGH:1;
      uint16_t URXINV:1;
      uint16_t ABAUD:1;
      uint16_t LPBACK:1;
      uint16_t WAKE:1;
      uint16_t UEN:2;
      uint16_t :1;
      uint16_t RTSMD:1;
      uint16_t IREN:1;
      uint16_t USIDL:1;
      uint16_t :1;
      uint16_t UARTEN:1;
    };
    struct {
      uint16_t :1;
      uint16_t PDSEL0:1;
      uint16_t PDSEL1:1;
      uint16_t :1;
      uint16_t RXINV:1;
      uint16_t :3;
      uint16_t UEN0:1;
      uint16_t UEN1:1;
    };
  };
} U3MODEBITS;
extern volatile U3MODEBITS U3MODEbits __attribute__((__sfr__));

#define U3STA U3STA
extern volatile uint16_t U3STA __attribute__((__sfr__));
__extension__ typedef struct tagU3STABITS {
  union {
    struct {
      uint16_t URXDA:1;
      uint16_t OERR:1;
      uint16_t FERR:1;
      uint16_t PERR:1;
      uint16_t RIDLE:1;
      uint16_t ADDEN:1;
      uint16_t URXISEL:2;
      uint16_t TRMT:1;
      uint16_t UTXBF:1;
      uint16_t UTXEN:1;
      uint16_t UTXBRK:1;
      uint16_t :1;
      uint16_t UTXISEL0:1;
      uint16_t UTXINV:1;
      uint16_t UTXISEL1:1;
    };
    struct {
      uint16_t :6;
      uint16_t URXISEL0:1;
      uint16_t URXISEL1:1;
      uint16_t :6;
      uint16_t TXINV:1;
    };
  };
} U3STABITS;
extern volatile U3STABITS U3STAbits __attribute__((__sfr__));

#define U3TXREG U3TXREG
extern volatile uint16_t U3TXREG __attribute__((__sfr__));
#define U3RXREG U3RXREG
extern volatile uint16_t U3RXREG __attribute__((__sfr__));
#define U3BRG U3BRG
extern volatile uint16_t U3BRG __attribute__((__sfr__));

#define SPI2 SPI2
extern volatile SPI SPI2 __attribute__((__sfr__));

#define SPI2STAT SPI2STAT
extern volatile uint16_t SPI2STAT __attribute__((__sfr__));
__extension__ typedef struct tagSPI2STATBITS {
  union {
    struct {
      uint16_t SPIRBF:1;
      uint16_t SPITBF:1;
      uint16_t SISEL:3;
      uint16_t SRXMPT:1;
      uint16_t SPIROV:1;
      uint16_t SRMPT:1;
      uint16_t SPIBEC:3;
      uint16_t :2;
      uint16_t SPISIDL:1;
      uint16_t :1;
      uint16_t SPIEN:1;
    };
    struct {
      uint16_t :2;
      uint16_t SISEL0:1;
      uint16_t SISEL1:1;
      uint16_t SISEL2:1;
      uint16_t :3;
      uint16_t SPIBEC0:1;
      uint16_t SPIBEC1:1;
      uint16_t SPIBEC2:1;
    };
  };
} SPI2STATBITS;
extern volatile SPI2STATBITS SPI2STATbits __attribute__((__sfr__));

#define SPI2CON1 SPI2CON1
extern volatile uint16_t SPI2CON1 __attribute__((__sfr__));
__extension__ typedef struct tagSPI2CON1BITS {
  union {
    struct {
      uint16_t PPRE:2;
      uint16_t SPRE:3;
      uint16_t MSTEN:1;
      uint16_t CKP:1;
      uint16_t SSEN:1;
      uint16_t CKE:1;
      uint16_t SMP:1;
      uint16_t MODE16:1;
      uint16_t DISSDO:1;
      uint16_t DISSCK:1;
    };
    struct {
      uint16_t PPRE0:1;
      uint16_t PPRE1:1;
      uint16_t SPRE0:1;
      uint16_t SPRE1:1;
      uint16_t SPRE2:1;
    };
  };
} SPI2CON1BITS;
extern volatile SPI2CON1BITS SPI2CON1bits __attribute__((__sfr__));

#define SPI2CON2 SPI2CON2
extern volatile uint16_t SPI2CON2 __attribute__((__sfr__));
__extension__ typedef struct tagSPI2CON2BITS {
  union {
    struct {
      uint16_t SPIBEN:1;
      uint16_t SPIFE:1;
      uint16_t :11;
      uint16_t SPIFPOL:1;
      uint16_t SPIFSD:1;
      uint16_t FRMEN:1;
    };
    struct {
      uint16_t :1;
      uint16_t FRMDLY:1;
      uint16_t :11;
      uint16_t FRMPOL:1;
    };
  };
} SPI2CON2BITS;
extern volatile SPI2CON2BITS SPI2CON2bits __attribute__((__sfr__));

