MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GC006/mcu.h
extern volatile ODCDBITS ODCDbits __attribute__((__sfr__));

#define TRISE TRISE
extern volatile uint16_t TRISE __attribute__((__sfr__));
typedef struct tagTRISEBITS {
  uint16_t TRISE0:1;
  uint16_t TRISE1:1;
  uint16_t TRISE2:1;
  uint16_t TRISE3:1;
  uint16_t TRISE4:1;
  uint16_t TRISE5:1;
  uint16_t TRISE6:1;
  uint16_t TRISE7:1;
} TRISEBITS;
extern volatile TRISEBITS TRISEbits __attribute__((__sfr__));

#define PORTE PORTE
extern volatile uint16_t PORTE __attribute__((__sfr__));
typedef struct tagPORTEBITS {
  uint16_t RE0:1;
  uint16_t RE1:1;
  uint16_t RE2:1;
  uint16_t RE3:1;
  uint16_t RE4:1;
  uint16_t RE5:1;
  uint16_t RE6:1;
  uint16_t RE7:1;
} PORTEBITS;
extern volatile PORTEBITS PORTEbits __attribute__((__sfr__));

#define LATE LATE
extern volatile uint16_t LATE __attribute__((__sfr__));
typedef struct tagLATEBITS {
  uint16_t LATE0:1;
  uint16_t LATE1:1;
  uint16_t LATE2:1;
  uint16_t LATE3:1;
  uint16_t LATE4:1;
  uint16_t LATE5:1;
  uint16_t LATE6:1;
  uint16_t LATE7:1;
} LATEBITS;
extern volatile LATEBITS LATEbits __attribute__((__sfr__));

#define ODCE ODCE
extern volatile uint16_t ODCE __attribute__((__sfr__));
typedef struct tagODCEBITS {
  uint16_t ODE0:1;
  uint16_t ODE1:1;
  uint16_t ODE2:1;
  uint16_t ODE3:1;
  uint16_t ODE4:1;
  uint16_t ODE5:1;
  uint16_t ODE6:1;
  uint16_t ODE7:1;
} ODCEBITS;
extern volatile ODCEBITS ODCEbits __attribute__((__sfr__));

#define TRISF TRISF
extern volatile uint16_t TRISF __attribute__((__sfr__));
typedef struct tagTRISFBITS {
  uint16_t TRISF0:1;
  uint16_t TRISF1:1;
  uint16_t :1;
  uint16_t TRISF3:1;
  uint16_t TRISF4:1;
  uint16_t TRISF5:1;
  uint16_t :1;
  uint16_t TRISF7:1;
} TRISFBITS;
extern volatile TRISFBITS TRISFbits __attribute__((__sfr__));

#define PORTF PORTF
extern volatile uint16_t PORTF __attribute__((__sfr__));
typedef struct tagPORTFBITS {
  uint16_t RF0:1;
  uint16_t RF1:1;
  uint16_t :1;
  uint16_t RF3:1;
  uint16_t RF4:1;
  uint16_t RF5:1;
  uint16_t :1;
  uint16_t RF7:1;
} PORTFBITS;
extern volatile PORTFBITS PORTFbits __attribute__((__sfr__));

#define LATF LATF
extern volatile uint16_t LATF __attribute__((__sfr__));
typedef struct tagLATFBITS {
  uint16_t LATF0:1;
  uint16_t LATF1:1;
  uint16_t :1;
  uint16_t LATF3:1;
  uint16_t LATF4:1;
  uint16_t LATF5:1;
  uint16_t :1;
  uint16_t LATF7:1;
} LATFBITS;
extern volatile LATFBITS LATFbits __attribute__((__sfr__));

#define ODCF ODCF
extern volatile uint16_t ODCF __attribute__((__sfr__));
typedef struct tagODCFBITS {
  uint16_t ODF0:1;
  uint16_t ODF1:1;
  uint16_t :1;
  uint16_t ODF3:1;
  uint16_t ODF4:1;
  uint16_t ODF5:1;
  uint16_t :1;
  uint16_t ODF7:1;
} ODCFBITS;
extern volatile ODCFBITS ODCFbits __attribute__((__sfr__));

#define TRISG TRISG
extern volatile uint16_t TRISG __attribute__((__sfr__));
typedef struct tagTRISGBITS {
  uint16_t :2;
  uint16_t TRISG2:1;
  uint16_t TRISG3:1;
  uint16_t :2;
  uint16_t TRISG6:1;
  uint16_t TRISG7:1;
  uint16_t TRISG8:1;
  uint16_t TRISG9:1;
} TRISGBITS;
extern volatile TRISGBITS TRISGbits __attribute__((__sfr__));

#define PORTG PORTG
extern volatile uint16_t PORTG __attribute__((__sfr__));
typedef struct tagPORTGBITS {
  uint16_t :2;
  uint16_t RG2:1;
  uint16_t RG3:1;
  uint16_t :2;
  uint16_t RG6:1;
  uint16_t RG7:1;
  uint16_t RG8:1;
  uint16_t RG9:1;
} PORTGBITS;
extern volatile PORTGBITS PORTGbits __attribute__((__sfr__));

#define LATG LATG
extern volatile uint16_t LATG __attribute__((__sfr__));
typedef struct tagLATGBITS {
  uint16_t :2;
  uint16_t LATG2:1;
  uint16_t LATG3:1;
  uint16_t :2;
  uint16_t LATG6:1;
  uint16_t LATG7:1;
  uint16_t LATG8:1;
  uint16_t LATG9:1;
} LATGBITS;
extern volatile LATGBITS LATGbits __attribute__((__sfr__));

#define ODCG ODCG
extern volatile uint16_t ODCG __attribute__((__sfr__));
typedef struct tagODCGBITS {
  uint16_t :2;
  uint16_t ODG2:1;
  uint16_t ODG3:1;
  uint16_t :2;
  uint16_t ODG6:1;
  uint16_t ODG7:1;
  uint16_t ODG8:1;
  uint16_t ODG9:1;
} ODCGBITS;
extern volatile ODCGBITS ODCGbits __attribute__((__sfr__));

#define PADCFG1 PADCFG1
extern volatile uint16_t PADCFG1 __attribute__((__sfr__));
typedef struct tagPADCFG1BITS {
  uint16_t PMPTTL:1;
} PADCFG1BITS;
extern volatile PADCFG1BITS PADCFG1bits __attribute__((__sfr__));

#define ADTBL0 ADTBL0
extern volatile uint16_t ADTBL0 __attribute__((__sfr__));
__extension__ typedef struct tagADTBL0BITS {
  union {
    struct {
      uint16_t ADCH:7;
      uint16_t :7;
      uint16_t DIFF:1;
      uint16_t UCTMU:1;
    };
    struct {
      uint16_t ADCH0:1;
      uint16_t ADCH1:1;
      uint16_t ADCH2:1;
      uint16_t ADCH3:1;
      uint16_t ADCH4:1;
      uint16_t ADCH5:1;
      uint16_t ADCH6:1;
    };
  };
} ADTBL0BITS;
extern volatile ADTBL0BITS ADTBL0bits __attribute__((__sfr__));

#define ADTBL1 ADTBL1
extern volatile uint16_t ADTBL1 __attribute__((__sfr__));
__extension__ typedef struct tagADTBL1BITS {
  union {
    struct {
      uint16_t ADCH:7;
      uint16_t :7;
      uint16_t DIFF:1;
      uint16_t UCTMU:1;
    };
    struct {
      uint16_t ADCH0:1;
      uint16_t ADCH1:1;
      uint16_t ADCH2:1;
      uint16_t ADCH3:1;
      uint16_t ADCH4:1;
      uint16_t ADCH5:1;
      uint16_t ADCH6:1;
    };
  };
} ADTBL1BITS;
extern volatile ADTBL1BITS ADTBL1bits __attribute__((__sfr__));

#define ADTBL2 ADTBL2
extern volatile uint16_t ADTBL2 __attribute__((__sfr__));
__extension__ typedef struct tagADTBL2BITS {
  union {
    struct {
      uint16_t ADCH:7;
      uint16_t :7;
      uint16_t DIFF:1;
      uint16_t UCTMU:1;
    };
    struct {
      uint16_t ADCH0:1;
      uint16_t ADCH1:1;
      uint16_t ADCH2:1;
      uint16_t ADCH3:1;
      uint16_t ADCH4:1;
      uint16_t ADCH5:1;
      uint16_t ADCH6:1;
    };
  };
} ADTBL2BITS;
extern volatile ADTBL2BITS ADTBL2bits __attribute__((__sfr__));

#define ADTBL3 ADTBL3
extern volatile uint16_t ADTBL3 __attribute__((__sfr__));
__extension__ typedef struct tagADTBL3BITS {
  union {
    struct {
      uint16_t ADCH:7;
      uint16_t :7;
      uint16_t DIFF:1;
      uint16_t UCTMU:1;
    };
    struct {
      uint16_t ADCH0:1;
      uint16_t ADCH1:1;
      uint16_t ADCH2:1;
      uint16_t ADCH3:1;
      uint16_t ADCH4:1;
      uint16_t ADCH5:1;
      uint16_t ADCH6:1;
    };
  };
} ADTBL3BITS;
