MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GC006/mcu.h
extern volatile LCDDATA3BITS LCDDATA3bits __attribute__((__sfr__));

#define LCDDATA4 LCDDATA4
extern volatile uint16_t LCDDATA4 __attribute__((__sfr__));
typedef struct tagLCDDATA4BITS {
  uint16_t S00C1:1;
  uint16_t S01C1:1;
  uint16_t S02C1:1;
  uint16_t S03C1:1;
  uint16_t S04C1:1;
  uint16_t S05C1:1;
  uint16_t S06C1:1;
  uint16_t S07C1:1;
  uint16_t S08C1:1;
  uint16_t S09C1:1;
  uint16_t S10C1:1;
  uint16_t S11C1:1;
  uint16_t S12C1:1;
  uint16_t S13C1:1;
  uint16_t S14C1:1;
  uint16_t S15C1:1;
} LCDDATA4BITS;
extern volatile LCDDATA4BITS LCDDATA4bits __attribute__((__sfr__));

#define LCDDATA5 LCDDATA5
extern volatile uint16_t LCDDATA5 __attribute__((__sfr__));
typedef struct tagLCDDATA5BITS {
  uint16_t S16C1:1;
  uint16_t S17C1:1;
  uint16_t S18C1:1;
  uint16_t S19C1:1;
  uint16_t S20C1:1;
  uint16_t S21C1:1;
  uint16_t S22C1:1;
  uint16_t S23C1:1;
  uint16_t S24C1:1;
  uint16_t S25C1:1;
  uint16_t S26C1:1;
  uint16_t S27C1:1;
  uint16_t :2;
  uint16_t S30C1:1;
} LCDDATA5BITS;
extern volatile LCDDATA5BITS LCDDATA5bits __attribute__((__sfr__));

#define LCDDATA6 LCDDATA6
extern volatile uint16_t LCDDATA6 __attribute__((__sfr__));
typedef struct tagLCDDATA6BITS {
  uint16_t :15;
  uint16_t S47C1:1;
} LCDDATA6BITS;
extern volatile LCDDATA6BITS LCDDATA6bits __attribute__((__sfr__));

#define LCDDATA7 LCDDATA7
extern volatile uint16_t LCDDATA7 __attribute__((__sfr__));
typedef struct tagLCDDATA7BITS {
  uint16_t S48C1:1;
  uint16_t :13;
  uint16_t S62C1:1;
} LCDDATA7BITS;
extern volatile LCDDATA7BITS LCDDATA7bits __attribute__((__sfr__));

#define LCDDATA8 LCDDATA8
extern volatile uint16_t LCDDATA8 __attribute__((__sfr__));
typedef struct tagLCDDATA8BITS {
  uint16_t S00C2:1;
  uint16_t S01C2:1;
  uint16_t S02C2:1;
  uint16_t S03C2:1;
  uint16_t S04C2:1;
  uint16_t S05C2:1;
  uint16_t S06C2:1;
  uint16_t S07C2:1;
  uint16_t S08C2:1;
  uint16_t S09C2:1;
  uint16_t S10C2:1;
  uint16_t S11C2:1;
  uint16_t S12C2:1;
  uint16_t S13C2:1;
  uint16_t S14C2:1;
  uint16_t S15C2:1;
} LCDDATA8BITS;
extern volatile LCDDATA8BITS LCDDATA8bits __attribute__((__sfr__));

#define LCDDATA9 LCDDATA9
extern volatile uint16_t LCDDATA9 __attribute__((__sfr__));
typedef struct tagLCDDATA9BITS {
  uint16_t S16C2:1;
  uint16_t S17C2:1;
  uint16_t S18C2:1;
  uint16_t S19C2:1;
  uint16_t S20C2:1;
  uint16_t S21C2:1;
  uint16_t S22C2:1;
  uint16_t S23C2:1;
  uint16_t S24C2:1;
  uint16_t S25C2:1;
  uint16_t S26C2:1;
  uint16_t S27C2:1;
  uint16_t :2;
  uint16_t S30C2:1;
} LCDDATA9BITS;
extern volatile LCDDATA9BITS LCDDATA9bits __attribute__((__sfr__));

#define LCDDATA10 LCDDATA10
extern volatile uint16_t LCDDATA10 __attribute__((__sfr__));
typedef struct tagLCDDATA10BITS {
  uint16_t :15;
  uint16_t S47C2:1;
} LCDDATA10BITS;
extern volatile LCDDATA10BITS LCDDATA10bits __attribute__((__sfr__));

#define LCDDATA11 LCDDATA11
extern volatile uint16_t LCDDATA11 __attribute__((__sfr__));
typedef struct tagLCDDATA11BITS {
  uint16_t S48C2:1;
  uint16_t :13;
  uint16_t S62C2:1;
} LCDDATA11BITS;
extern volatile LCDDATA11BITS LCDDATA11bits __attribute__((__sfr__));

#define LCDDATA12 LCDDATA12
extern volatile uint16_t LCDDATA12 __attribute__((__sfr__));
typedef struct tagLCDDATA12BITS {
  uint16_t S00C3:1;
  uint16_t S01C3:1;
  uint16_t S02C3:1;
  uint16_t S03C3:1;
  uint16_t S04C3:1;
  uint16_t S05C3:1;
  uint16_t S06C3:1;
  uint16_t S07C3:1;
  uint16_t S08C3:1;
  uint16_t S09C3:1;
  uint16_t S10C3:1;
  uint16_t S11C3:1;
  uint16_t S12C3:1;
  uint16_t S13C3:1;
  uint16_t S14C3:1;
  uint16_t S15C3:1;
} LCDDATA12BITS;
extern volatile LCDDATA12BITS LCDDATA12bits __attribute__((__sfr__));

#define LCDDATA13 LCDDATA13
extern volatile uint16_t LCDDATA13 __attribute__((__sfr__));
typedef struct tagLCDDATA13BITS {
  uint16_t S16C3:1;
  uint16_t S17C3:1;
  uint16_t S18C3:1;
  uint16_t S19C3:1;
  uint16_t S20C3:1;
  uint16_t S21C3:1;
  uint16_t S22C3:1;
  uint16_t S23C3:1;
  uint16_t S24C3:1;
  uint16_t S25C3:1;
  uint16_t S26C3:1;
  uint16_t S27C3:1;
  uint16_t :2;
  uint16_t S30C3:1;
} LCDDATA13BITS;
extern volatile LCDDATA13BITS LCDDATA13bits __attribute__((__sfr__));

#define LCDDATA14 LCDDATA14
extern volatile uint16_t LCDDATA14 __attribute__((__sfr__));
typedef struct tagLCDDATA14BITS {
  uint16_t :15;
  uint16_t S47C3:1;
} LCDDATA14BITS;
extern volatile LCDDATA14BITS LCDDATA14bits __attribute__((__sfr__));

#define LCDDATA15 LCDDATA15
extern volatile uint16_t LCDDATA15 __attribute__((__sfr__));
typedef struct tagLCDDATA15BITS {
  uint16_t S48C3:1;
  uint16_t :13;
  uint16_t S62C3:1;
} LCDDATA15BITS;
extern volatile LCDDATA15BITS LCDDATA15bits __attribute__((__sfr__));

#define LCDDATA16 LCDDATA16
extern volatile uint16_t LCDDATA16 __attribute__((__sfr__));
typedef struct tagLCDDATA16BITS {
  uint16_t S00C4:1;
  uint16_t S01C4:1;
  uint16_t S02C4:1;
  uint16_t S03C4:1;
  uint16_t S04C4:1;
  uint16_t S05C4:1;
  uint16_t S06C4:1;
  uint16_t S07C4:1;
  uint16_t S08C4:1;
  uint16_t S09C4:1;
  uint16_t S10C4:1;
  uint16_t S11C4:1;
  uint16_t S12C4:1;
  uint16_t S13C4:1;
  uint16_t S14C4:1;
  uint16_t S15C4:1;
} LCDDATA16BITS;
extern volatile LCDDATA16BITS LCDDATA16bits __attribute__((__sfr__));

#define LCDDATA17 LCDDATA17
extern volatile uint16_t LCDDATA17 __attribute__((__sfr__));
typedef struct tagLCDDATA17BITS {
  uint16_t S16C4:1;
  uint16_t S17C4:1;
  uint16_t S18C4:1;
  uint16_t S19C4:1;
  uint16_t S20C4:1;
  uint16_t S21C4:1;
  uint16_t S22C4:1;
  uint16_t S23C4:1;
  uint16_t S24C4:1;
  uint16_t S25C4:1;
  uint16_t S26C4:1;
  uint16_t S27C4:1;
  uint16_t :2;
  uint16_t S30C4:1;
} LCDDATA17BITS;
extern volatile LCDDATA17BITS LCDDATA17bits __attribute__((__sfr__));

#define LCDDATA18 LCDDATA18
extern volatile uint16_t LCDDATA18 __attribute__((__sfr__));
typedef struct tagLCDDATA18BITS {
  uint16_t :15;
  uint16_t S47C4:1;
} LCDDATA18BITS;
extern volatile LCDDATA18BITS LCDDATA18bits __attribute__((__sfr__));

#define LCDDATA19 LCDDATA19
extern volatile uint16_t LCDDATA19 __attribute__((__sfr__));
typedef struct tagLCDDATA19BITS {
  uint16_t S48C4:1;
  uint16_t :13;
  uint16_t S62C4:1;
} LCDDATA19BITS;
extern volatile LCDDATA19BITS LCDDATA19bits __attribute__((__sfr__));

#define LCDDATA20 LCDDATA20
extern volatile uint16_t LCDDATA20 __attribute__((__sfr__));
typedef struct tagLCDDATA20BITS {
  uint16_t S00C5:1;
  uint16_t S01C5:1;
  uint16_t S02C5:1;
  uint16_t S03C5:1;
  uint16_t S04C5:1;
  uint16_t S05C5:1;
  uint16_t S06C5:1;
  uint16_t S07C5:1;
  uint16_t S08C5:1;
  uint16_t S09C5:1;
  uint16_t S10C5:1;
  uint16_t S11C5:1;
  uint16_t S12C5:1;
  uint16_t S13C5:1;
  uint16_t S14C5:1;
  uint16_t S15C5:1;
} LCDDATA20BITS;
extern volatile LCDDATA20BITS LCDDATA20bits __attribute__((__sfr__));

