MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GC006/mcu.h
#define LCDDATA21 LCDDATA21
extern volatile uint16_t LCDDATA21 __attribute__((__sfr__));
typedef struct tagLCDDATA21BITS {
  uint16_t S16C5:1;
  uint16_t S17C5:1;
  uint16_t S18C5:1;
  uint16_t S19C5:1;
  uint16_t S20C5:1;
  uint16_t S21C5:1;
  uint16_t S22C5:1;
  uint16_t S23C5:1;
  uint16_t S24C5:1;
  uint16_t S25C5:1;
  uint16_t S26C5:1;
  uint16_t S27C5:1;
  uint16_t :2;
  uint16_t S30C5:1;
} LCDDATA21BITS;
extern volatile LCDDATA21BITS LCDDATA21bits __attribute__((__sfr__));

#define LCDDATA22 LCDDATA22
extern volatile uint16_t LCDDATA22 __attribute__((__sfr__));
typedef struct tagLCDDATA22BITS {
  uint16_t :15;
  uint16_t S47C5:1;
} LCDDATA22BITS;
extern volatile LCDDATA22BITS LCDDATA22bits __attribute__((__sfr__));

#define LCDDATA23 LCDDATA23
extern volatile uint16_t LCDDATA23 __attribute__((__sfr__));
typedef struct tagLCDDATA23BITS {
  uint16_t S48C5:1;
  uint16_t :13;
  uint16_t S62C5:1;
} LCDDATA23BITS;
extern volatile LCDDATA23BITS LCDDATA23bits __attribute__((__sfr__));

#define LCDDATA24 LCDDATA24
extern volatile uint16_t LCDDATA24 __attribute__((__sfr__));
typedef struct tagLCDDATA24BITS {
  uint16_t S00C6:1;
  uint16_t S01C6:1;
  uint16_t S02C6:1;
  uint16_t S03C6:1;
  uint16_t S04C6:1;
  uint16_t S05C6:1;
  uint16_t S06C6:1;
  uint16_t S07C6:1;
  uint16_t S08C6:1;
  uint16_t S09C6:1;
  uint16_t S10C6:1;
  uint16_t S11C6:1;
  uint16_t S12C6:1;
  uint16_t S13C6:1;
  uint16_t S14C6:1;
  uint16_t S15C6:1;
} LCDDATA24BITS;
extern volatile LCDDATA24BITS LCDDATA24bits __attribute__((__sfr__));

#define LCDDATA25 LCDDATA25
extern volatile uint16_t LCDDATA25 __attribute__((__sfr__));
typedef struct tagLCDDATA25BITS {
  uint16_t S16C6:1;
  uint16_t S17C6:1;
  uint16_t S18C6:1;
  uint16_t S19C6:1;
  uint16_t S20C6:1;
  uint16_t S21C6:1;
  uint16_t S22C6:1;
  uint16_t S23C6:1;
  uint16_t S24C6:1;
  uint16_t S25C6:1;
  uint16_t S26C6:1;
  uint16_t S27C6:1;
  uint16_t :2;
  uint16_t S30C6:1;
} LCDDATA25BITS;
extern volatile LCDDATA25BITS LCDDATA25bits __attribute__((__sfr__));

#define LCDDATA26 LCDDATA26
extern volatile uint16_t LCDDATA26 __attribute__((__sfr__));
typedef struct tagLCDDATA26BITS {
  uint16_t :15;
  uint16_t S47C6:1;
} LCDDATA26BITS;
extern volatile LCDDATA26BITS LCDDATA26bits __attribute__((__sfr__));

#define LCDDATA27 LCDDATA27
extern volatile uint16_t LCDDATA27 __attribute__((__sfr__));
typedef struct tagLCDDATA27BITS {
  uint16_t S48C6:1;
  uint16_t :13;
  uint16_t S62C6:1;
} LCDDATA27BITS;
extern volatile LCDDATA27BITS LCDDATA27bits __attribute__((__sfr__));

#define LCDDATA28 LCDDATA28
extern volatile uint16_t LCDDATA28 __attribute__((__sfr__));
typedef struct tagLCDDATA28BITS {
  uint16_t S00C7:1;
  uint16_t S01C7:1;
  uint16_t S02C7:1;
  uint16_t S03C7:1;
  uint16_t S04C7:1;
  uint16_t S05C7:1;
  uint16_t S06C7:1;
  uint16_t S07C7:1;
  uint16_t S08C7:1;
  uint16_t S09C7:1;
  uint16_t S10C7:1;
  uint16_t S11C7:1;
  uint16_t S12C7:1;
  uint16_t S13C7:1;
  uint16_t S14C7:1;
  uint16_t S15C7:1;
} LCDDATA28BITS;
extern volatile LCDDATA28BITS LCDDATA28bits __attribute__((__sfr__));

#define LCDDATA29 LCDDATA29
extern volatile uint16_t LCDDATA29 __attribute__((__sfr__));
typedef struct tagLCDDATA29BITS {
  uint16_t S16C7:1;
  uint16_t S17C7:1;
  uint16_t S18C7:1;
  uint16_t S19C7:1;
  uint16_t S20C7:1;
  uint16_t S21C7:1;
  uint16_t S22C7:1;
  uint16_t S23C7:1;
  uint16_t S24C7:1;
  uint16_t S25C7:1;
  uint16_t S26C7:1;
  uint16_t S27C7:1;
  uint16_t :2;
  uint16_t S30C7:1;
} LCDDATA29BITS;
extern volatile LCDDATA29BITS LCDDATA29bits __attribute__((__sfr__));

#define LCDDATA30 LCDDATA30
extern volatile uint16_t LCDDATA30 __attribute__((__sfr__));
typedef struct tagLCDDATA30BITS {
  uint16_t :15;
  uint16_t S47C7:1;
} LCDDATA30BITS;
extern volatile LCDDATA30BITS LCDDATA30bits __attribute__((__sfr__));

#define LCDDATA31 LCDDATA31
extern volatile uint16_t LCDDATA31 __attribute__((__sfr__));
typedef struct tagLCDDATA31BITS {
  uint16_t S48C7:1;
  uint16_t :13;
  uint16_t S62C7:1;
} LCDDATA31BITS;
extern volatile LCDDATA31BITS LCDDATA31bits __attribute__((__sfr__));

#define PMCON1 PMCON1
extern volatile uint16_t PMCON1 __attribute__((__sfr__));
__extension__ typedef struct tagPMCON1BITS {
  union {
    struct {
      uint16_t IRQM:2;
      uint16_t BUSKEEP:1;
      uint16_t :1;
      uint16_t ALMODE:1;
      uint16_t ALP:1;
      uint16_t CSF:2;
      uint16_t MODE:2;
      uint16_t :1;
      uint16_t ADRMUX:2;
      uint16_t PSIDL:1;
      uint16_t :1;
      uint16_t PMPEN:1;
    };
    struct {
      uint16_t IRQM0:1;
      uint16_t IRQM1:1;
      uint16_t :4;
      uint16_t CSF0:1;
      uint16_t CSF1:1;
      uint16_t MODE0:1;
      uint16_t MODE1:1;
      uint16_t :1;
      uint16_t ADRMUX0:1;
      uint16_t ADRMUX1:1;
    };
  };
} PMCON1BITS;
extern volatile PMCON1BITS PMCON1bits __attribute__((__sfr__));

#define PMCON2 PMCON2
extern volatile uint16_t PMCON2 __attribute__((__sfr__));
__extension__ typedef struct tagPMCON2BITS {
  union {
    struct {
      uint16_t RADDR:8;
      uint16_t :4;
      uint16_t TIMEOUT:1;
      uint16_t ERROR:1;
      uint16_t :1;
      uint16_t BUSY:1;
    };
    struct {
      uint16_t RADDR16:1;
      uint16_t RADDR17:1;
      uint16_t RADDR18:1;
      uint16_t RADDR19:1;
      uint16_t RADDR20:1;
      uint16_t RADDR21:1;
      uint16_t RADDR22:1;
      uint16_t RADDR23:1;
    };
  };
} PMCON2BITS;
extern volatile PMCON2BITS PMCON2bits __attribute__((__sfr__));

#define PMCON3 PMCON3
extern volatile uint16_t PMCON3 __attribute__((__sfr__));
__extension__ typedef struct tagPMCON3BITS {
  union {
    struct {
      uint16_t PTEN16:1;
      uint16_t PTEN17:1;
      uint16_t PTEN18:1;
      uint16_t PTEN19:1;
      uint16_t PTEN20:1;
      uint16_t PTEN21:1;
      uint16_t PTEN22:1;
      uint16_t :1;
      uint16_t AWAITE:1;
      uint16_t AWAITM:2;
      uint16_t :1;
      uint16_t PTBE0EN:1;
      uint16_t PTBE1EN:1;
      uint16_t PTRDEN:1;
      uint16_t PTWREN:1;
    };
    struct {
      uint16_t :9;
      uint16_t AWAITM0:1;
      uint16_t AWAITM1:1;
    };
  };
} PMCON3BITS;
extern volatile PMCON3BITS PMCON3bits __attribute__((__sfr__));

#define PMCON4 PMCON4
extern volatile uint16_t PMCON4 __attribute__((__sfr__));
typedef struct tagPMCON4BITS {
  uint16_t PTEN0:1;
  uint16_t PTEN1:1;
  uint16_t PTEN2:1;
  uint16_t PTEN3:1;
  uint16_t PTEN4:1;
  uint16_t PTEN5:1;
  uint16_t PTEN6:1;
  uint16_t PTEN7:1;
  uint16_t PTEN8:1;
  uint16_t PTEN9:1;
  uint16_t PTEN10:1;
  uint16_t PTEN11:1;
  uint16_t PTEN12:1;
  uint16_t PTEN13:1;
  uint16_t PTEN14:1;
  uint16_t PTEN15:1;
} PMCON4BITS;
extern volatile PMCON4BITS PMCON4bits __attribute__((__sfr__));

#define PMCS1CF PMCS1CF
extern volatile uint16_t PMCS1CF __attribute__((__sfr__));
__extension__ typedef struct tagPMCS1CFBITS {
  union {
    struct {
      uint16_t :5;
      uint16_t PTSZ:2;
      uint16_t ACKP:1;
      uint16_t SM:1;
      uint16_t RDSP:1;
      uint16_t WRSP:1;
      uint16_t :1;
      uint16_t BEP:1;
      uint16_t CSPTEN:1;
      uint16_t CSP:1;
      uint16_t CSDIS:1;
    };
    struct {
      uint16_t :5;
      uint16_t PTSZ0:1;
      uint16_t PTSZ1:1;
    };
  };
} PMCS1CFBITS;
