MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GC006/mcu.h
/* TRISE */
#define _TRISE0 TRISEbits.TRISE0
#define _TRISE1 TRISEbits.TRISE1
#define _TRISE2 TRISEbits.TRISE2
#define _TRISE3 TRISEbits.TRISE3
#define _TRISE4 TRISEbits.TRISE4
#define _TRISE5 TRISEbits.TRISE5
#define _TRISE6 TRISEbits.TRISE6
#define _TRISE7 TRISEbits.TRISE7

/* PORTE */
#define _RE0 PORTEbits.RE0
#define _RE1 PORTEbits.RE1
#define _RE2 PORTEbits.RE2
#define _RE3 PORTEbits.RE3
#define _RE4 PORTEbits.RE4
#define _RE5 PORTEbits.RE5
#define _RE6 PORTEbits.RE6
#define _RE7 PORTEbits.RE7

/* LATE */
#define _LATE0 LATEbits.LATE0
#define _LATE1 LATEbits.LATE1
#define _LATE2 LATEbits.LATE2
#define _LATE3 LATEbits.LATE3
#define _LATE4 LATEbits.LATE4
#define _LATE5 LATEbits.LATE5
#define _LATE6 LATEbits.LATE6
#define _LATE7 LATEbits.LATE7

/* ODCE */
#define _ODE0 ODCEbits.ODE0
#define _ODE1 ODCEbits.ODE1
#define _ODE2 ODCEbits.ODE2
#define _ODE3 ODCEbits.ODE3
#define _ODE4 ODCEbits.ODE4
#define _ODE5 ODCEbits.ODE5
#define _ODE6 ODCEbits.ODE6
#define _ODE7 ODCEbits.ODE7

/* TRISF */
#define _TRISF0 TRISFbits.TRISF0
#define _TRISF1 TRISFbits.TRISF1
#define _TRISF3 TRISFbits.TRISF3
#define _TRISF4 TRISFbits.TRISF4
#define _TRISF5 TRISFbits.TRISF5
#define _TRISF7 TRISFbits.TRISF7

/* PORTF */
#define _RF0 PORTFbits.RF0
#define _RF1 PORTFbits.RF1
#define _RF3 PORTFbits.RF3
#define _RF4 PORTFbits.RF4
#define _RF5 PORTFbits.RF5
#define _RF7 PORTFbits.RF7

/* LATF */
#define _LATF0 LATFbits.LATF0
#define _LATF1 LATFbits.LATF1
#define _LATF3 LATFbits.LATF3
#define _LATF4 LATFbits.LATF4
#define _LATF5 LATFbits.LATF5
#define _LATF7 LATFbits.LATF7

/* ODCF */
#define _ODF0 ODCFbits.ODF0
#define _ODF1 ODCFbits.ODF1
#define _ODF3 ODCFbits.ODF3
#define _ODF4 ODCFbits.ODF4
#define _ODF5 ODCFbits.ODF5
#define _ODF7 ODCFbits.ODF7

/* TRISG */
#define _TRISG2 TRISGbits.TRISG2
#define _TRISG3 TRISGbits.TRISG3
#define _TRISG6 TRISGbits.TRISG6
#define _TRISG7 TRISGbits.TRISG7
#define _TRISG8 TRISGbits.TRISG8
#define _TRISG9 TRISGbits.TRISG9

/* PORTG */
#define _RG2 PORTGbits.RG2
#define _RG3 PORTGbits.RG3
#define _RG6 PORTGbits.RG6
#define _RG7 PORTGbits.RG7
#define _RG8 PORTGbits.RG8
#define _RG9 PORTGbits.RG9

/* LATG */
#define _LATG2 LATGbits.LATG2
#define _LATG3 LATGbits.LATG3
#define _LATG6 LATGbits.LATG6
#define _LATG7 LATGbits.LATG7
#define _LATG8 LATGbits.LATG8
#define _LATG9 LATGbits.LATG9

/* ODCG */
#define _ODG2 ODCGbits.ODG2
#define _ODG3 ODCGbits.ODG3
#define _ODG6 ODCGbits.ODG6
#define _ODG7 ODCGbits.ODG7
#define _ODG8 ODCGbits.ODG8
#define _ODG9 ODCGbits.ODG9

/* PADCFG1 */
#define _PMPTTL PADCFG1bits.PMPTTL

/* ADTBL0 */
/* Bitname _ADCH cannot be defined because it is used by more than one SFR */
/* Bitname _DIFF cannot be defined because it is used by more than one SFR */
/* Bitname _UCTMU cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH0 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH1 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH2 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH3 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH4 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH5 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH6 cannot be defined because it is used by more than one SFR */

/* ADTBL1 */
/* Bitname _ADCH cannot be defined because it is used by more than one SFR */
/* Bitname _DIFF cannot be defined because it is used by more than one SFR */
/* Bitname _UCTMU cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH0 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH1 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH2 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH3 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH4 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH5 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH6 cannot be defined because it is used by more than one SFR */

/* ADTBL2 */
/* Bitname _ADCH cannot be defined because it is used by more than one SFR */
/* Bitname _DIFF cannot be defined because it is used by more than one SFR */
/* Bitname _UCTMU cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH0 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH1 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH2 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH3 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH4 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH5 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH6 cannot be defined because it is used by more than one SFR */

/* ADTBL3 */
/* Bitname _ADCH cannot be defined because it is used by more than one SFR */
/* Bitname _DIFF cannot be defined because it is used by more than one SFR */
/* Bitname _UCTMU cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH0 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH1 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH2 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH3 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH4 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH5 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH6 cannot be defined because it is used by more than one SFR */

/* ADTBL4 */
/* Bitname _ADCH cannot be defined because it is used by more than one SFR */
/* Bitname _DIFF cannot be defined because it is used by more than one SFR */
/* Bitname _UCTMU cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH0 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH1 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH2 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH3 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH4 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH5 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH6 cannot be defined because it is used by more than one SFR */

/* ADTBL5 */
/* Bitname _ADCH cannot be defined because it is used by more than one SFR */
/* Bitname _DIFF cannot be defined because it is used by more than one SFR */
/* Bitname _UCTMU cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH0 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH1 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH2 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH3 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH4 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH5 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH6 cannot be defined because it is used by more than one SFR */

/* ADTBL6 */
/* Bitname _ADCH cannot be defined because it is used by more than one SFR */
/* Bitname _DIFF cannot be defined because it is used by more than one SFR */
/* Bitname _UCTMU cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH0 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH1 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH2 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH3 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH4 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH5 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH6 cannot be defined because it is used by more than one SFR */

