MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GC006/mcu.h
/* SD1CON3 */
#define _SDCH SD1CON3bits.SDCH
#define _SDCS SD1CON3bits.SDCS
#define _SDOSR SD1CON3bits.SDOSR
#define _SDDIV SD1CON3bits.SDDIV
#define _SDCH0 SD1CON3bits.SDCH0
#define _SDCH1 SD1CON3bits.SDCH1
#define _SDCH2 SD1CON3bits.SDCH2
#define _SDCS0 SD1CON3bits.SDCS0
#define _SDCS1 SD1CON3bits.SDCS1
#define _SDOSR0 SD1CON3bits.SDOSR0
#define _SDOSR1 SD1CON3bits.SDOSR1
#define _SDOSR2 SD1CON3bits.SDOSR2
#define _SDDIV0 SD1CON3bits.SDDIV0
#define _SDDIV1 SD1CON3bits.SDDIV1
#define _SDDIV2 SD1CON3bits.SDDIV2

/* ANCFG */
#define _VBG2EN ANCFGbits.VBG2EN

/* ANSB */
#define _ANSB0 ANSBbits.ANSB0
#define _ANSB1 ANSBbits.ANSB1
#define _ANSB2 ANSBbits.ANSB2
#define _ANSB3 ANSBbits.ANSB3
#define _ANSB4 ANSBbits.ANSB4
#define _ANSB5 ANSBbits.ANSB5
#define _ANSB6 ANSBbits.ANSB6
#define _ANSB7 ANSBbits.ANSB7
#define _ANSB12 ANSBbits.ANSB12
#define _ANSB13 ANSBbits.ANSB13
#define _ANSB14 ANSBbits.ANSB14
#define _ANSB15 ANSBbits.ANSB15
#define _ANSELB0 ANSBbits.ANSELB0
#define _ANSELB1 ANSBbits.ANSELB1
#define _ANSELB2 ANSBbits.ANSELB2
#define _ANSELB3 ANSBbits.ANSELB3
#define _ANSELB4 ANSBbits.ANSELB4
#define _ANSELB5 ANSBbits.ANSELB5
#define _ANSELB6 ANSBbits.ANSELB6
#define _ANSELB7 ANSBbits.ANSELB7
#define _ANSELB12 ANSBbits.ANSELB12
#define _ANSELB13 ANSBbits.ANSELB13
#define _ANSELB14 ANSBbits.ANSELB14
#define _ANSELB15 ANSBbits.ANSELB15

/* ANSD */
#define _ANSD0 ANSDbits.ANSD0
#define _ANSD1 ANSDbits.ANSD1
#define _ANSD2 ANSDbits.ANSD2
#define _ANSD3 ANSDbits.ANSD3
#define _ANSD4 ANSDbits.ANSD4
#define _ANSD5 ANSDbits.ANSD5
#define _ANSD6 ANSDbits.ANSD6
#define _ANSD7 ANSDbits.ANSD7
#define _ANSD8 ANSDbits.ANSD8
#define _ANSD9 ANSDbits.ANSD9
#define _ANSD10 ANSDbits.ANSD10
#define _ANSD11 ANSDbits.ANSD11
#define _ANSD12 ANSDbits.ANSD12
#define _ANSD13 ANSDbits.ANSD13
#define _ANSD14 ANSDbits.ANSD14
#define _ANSD15 ANSDbits.ANSD15
#define _ANSELD0 ANSDbits.ANSELD0
#define _ANSELD1 ANSDbits.ANSELD1
#define _ANSELD2 ANSDbits.ANSELD2
#define _ANSELD3 ANSDbits.ANSELD3
#define _ANSELD4 ANSDbits.ANSELD4
#define _ANSELD5 ANSDbits.ANSELD5
#define _ANSELD6 ANSDbits.ANSELD6
#define _ANSELD7 ANSDbits.ANSELD7
#define _ANSELD8 ANSDbits.ANSELD8
#define _ANSELD9 ANSDbits.ANSELD9
#define _ANSELD10 ANSDbits.ANSELD10
#define _ANSELD11 ANSDbits.ANSELD11
#define _ANSELD12 ANSDbits.ANSELD12
#define _ANSELD13 ANSDbits.ANSELD13
#define _ANSELD14 ANSDbits.ANSELD14
#define _ANSELD15 ANSDbits.ANSELD15

/* ANSE */
#define _ANSE4 ANSEbits.ANSE4
#define _ANSE5 ANSEbits.ANSE5
#define _ANSE6 ANSEbits.ANSE6
#define _ANSE7 ANSEbits.ANSE7
#define _ANSELE4 ANSEbits.ANSELE4
#define _ANSELE5 ANSEbits.ANSELE5
#define _ANSELE6 ANSEbits.ANSELE6
#define _ANSELE7 ANSEbits.ANSELE7

/* ANSELF */
#define _ANSF0 ANSELFbits.ANSF0
#define _ANSF3 ANSELFbits.ANSF3
#define _ANSF4 ANSELFbits.ANSF4
#define _ANSF5 ANSELFbits.ANSF5
#define _ANSF7 ANSELFbits.ANSF7
#define _ANSELF0 ANSELFbits.ANSELF0
#define _ANSELF3 ANSELFbits.ANSELF3
#define _ANSELF4 ANSELFbits.ANSELF4
#define _ANSELF5 ANSELFbits.ANSELF5
#define _ANSELF7 ANSELFbits.ANSELF7

/* ANSELG */
#define _ANSG6 ANSELGbits.ANSG6
#define _ANSG7 ANSELGbits.ANSG7
#define _ANSG8 ANSELGbits.ANSG8
#define _ANSG9 ANSELGbits.ANSG9
#define _ANSELG6 ANSELGbits.ANSELG6
#define _ANSELG7 ANSELGbits.ANSELG7
#define _ANSELG8 ANSELGbits.ANSELG8
#define _ANSELG9 ANSELGbits.ANSELG9

/* ADCON1 */
/* Bitname _PWRLVL cannot be defined because it is used by more than one SFR */
#define _ADCAL ADCON1bits.ADCAL
#define _PUMPEN ADCON1bits.PUMPEN
#define _FORM ADCON1bits.FORM
#define _ADSLP ADCON1bits.ADSLP
#define _ADSIDL ADCON1bits.ADSIDL
#define _ADON ADCON1bits.ADON
#define _FORM0 ADCON1bits.FORM0
#define _FORM1 ADCON1bits.FORM1
#define _FORM2 ADCON1bits.FORM2
#define _FORM3 ADCON1bits.FORM3

/* ADCON2 */
#define _ADHALT ADCON2bits.ADHALT
#define _REFPUMP ADCON2bits.REFPUMP
#define _BUFORG ADCON2bits.BUFORG
#define _NVCFG0 ADCON2bits.NVCFG0
#define _PVCFG ADCON2bits.PVCFG
#define _NVCFG ADCON2bits.NVCFG
#define _PVCFG0 ADCON2bits.PVCFG0
#define _PVCFG1 ADCON2bits.PVCFG1
#define _RFPUMP ADCON2bits.RFPUMP

/* ADCON3 */
#define _ADCS ADCON3bits.ADCS
#define _ADRC ADCON3bits.ADRC
#define _ADCS0 ADCON3bits.ADCS0
#define _ADCS1 ADCON3bits.ADCS1
#define _ADCS2 ADCON3bits.ADCS2
#define _ADCS3 ADCON3bits.ADCS3
#define _ADCS4 ADCON3bits.ADCS4
#define _ADCS5 ADCON3bits.ADCS5
#define _ADCS6 ADCON3bits.ADCS6
#define _ADCS7 ADCON3bits.ADCS7
/* Bitname _SLEN cannot be defined because it is used by more than one SFR */
#define _SLEN0 ADCON3bits.SLEN0
#define _SLEN1 ADCON3bits.SLEN1
#define _SLEN2 ADCON3bits.SLEN2
#define _SLEN3 ADCON3bits.SLEN3

/* ADSTATL */
#define _SL0IF ADSTATLbits.SL0IF
#define _SL1IF ADSTATLbits.SL1IF
#define _SL2IF ADSTATLbits.SL2IF
#define _SL3IF ADSTATLbits.SL3IF
#define _ACCIF ADSTATLbits.ACCIF
#define _BUFIF ADSTATLbits.BUFIF
#define _SLERR ADSTATLbits.SLERR
#define _SLERR0 ADSTATLbits.SLERR0
#define _SLERR1 ADSTATLbits.SLERR1
#define _SLERR2 ADSTATLbits.SLERR2
#define _SLERR3 ADSTATLbits.SLERR3
#define _SLOV ADSTATLbits.SLOV

/* ADSTATH */
#define _ADBUSY ADSTATHbits.ADBUSY
#define _ADREADY ADSTATHbits.ADREADY
#define _PUMPST ADSTATHbits.PUMPST

/* ACCONL */
#define _COUNT ACCONLbits.COUNT
#define _TBLSEL ACCONLbits.TBLSEL
#define _COUNT0 ACCONLbits.COUNT0
#define _COUNT1 ACCONLbits.COUNT1
#define _COUNT2 ACCONLbits.COUNT2
#define _COUNT3 ACCONLbits.COUNT3
#define _COUNT4 ACCONLbits.COUNT4
#define _COUNT5 ACCONLbits.COUNT5
#define _COUNT6 ACCONLbits.COUNT6
#define _COUNT7 ACCONLbits.COUNT7
#define _TBLSEL0 ACCONLbits.TBLSEL0
#define _TBLSEL1 ACCONLbits.TBLSEL1
#define _TBLSEL2 ACCONLbits.TBLSEL2
#define _TBLSEL3 ACCONLbits.TBLSEL3
#define _TBLSEL4 ACCONLbits.TBLSEL4
#define _TBLSEL5 ACCONLbits.TBLSEL5

/* ACCONH */
#define _ACIE ACCONHbits.ACIE
#define _ACEN ACCONHbits.ACEN

/* ADCHITL */
#define _CHH0 ADCHITLbits.CHH0
#define _CHH1 ADCHITLbits.CHH1
#define _CHH2 ADCHITLbits.CHH2
#define _CHH3 ADCHITLbits.CHH3
#define _CHH4 ADCHITLbits.CHH4
#define _CHH5 ADCHITLbits.CHH5
#define _CHH6 ADCHITLbits.CHH6
#define _CHH7 ADCHITLbits.CHH7
#define _CHH8 ADCHITLbits.CHH8
#define _CHH9 ADCHITLbits.CHH9
#define _CHH10 ADCHITLbits.CHH10
#define _CHH11 ADCHITLbits.CHH11
#define _CHH12 ADCHITLbits.CHH12
#define _CHH13 ADCHITLbits.CHH13
#define _CHH14 ADCHITLbits.CHH14
#define _CHH15 ADCHITLbits.CHH15

/* ADCHITH */
#define _CHH16 ADCHITHbits.CHH16
#define _CHH17 ADCHITHbits.CHH17
#define _CHH18 ADCHITHbits.CHH18
#define _CHH19 ADCHITHbits.CHH19
#define _CHH20 ADCHITHbits.CHH20
#define _CHH21 ADCHITHbits.CHH21
#define _CHH22 ADCHITHbits.CHH22
#define _CHH23 ADCHITHbits.CHH23
#define _CHH24 ADCHITHbits.CHH24
#define _CHH25 ADCHITHbits.CHH25
#define _CHH26 ADCHITHbits.CHH26
#define _CHH27 ADCHITHbits.CHH27
#define _CHH28 ADCHITHbits.CHH28
#define _CHH29 ADCHITHbits.CHH29
#define _CHH30 ADCHITHbits.CHH30
#define _CHH31 ADCHITHbits.CHH31

