MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GC006/mcu.h
#define _ADTBL8_ADCH4_POSITION                   0x00000004
#define _ADTBL8_ADCH4_MASK                       0x00000010
#define _ADTBL8_ADCH4_LENGTH                     0x00000001

#define _ADTBL8_ADCH5_POSITION                   0x00000005
#define _ADTBL8_ADCH5_MASK                       0x00000020
#define _ADTBL8_ADCH5_LENGTH                     0x00000001

#define _ADTBL8_ADCH6_POSITION                   0x00000006
#define _ADTBL8_ADCH6_MASK                       0x00000040
#define _ADTBL8_ADCH6_LENGTH                     0x00000001

#define _ADTBL9_ADCH_POSITION                    0x00000000
#define _ADTBL9_ADCH_MASK                        0x0000007F
#define _ADTBL9_ADCH_LENGTH                      0x00000007

#define _ADTBL9_DIFF_POSITION                    0x0000000E
#define _ADTBL9_DIFF_MASK                        0x00004000
#define _ADTBL9_DIFF_LENGTH                      0x00000001

#define _ADTBL9_UCTMU_POSITION                   0x0000000F
#define _ADTBL9_UCTMU_MASK                       0x00008000
#define _ADTBL9_UCTMU_LENGTH                     0x00000001

#define _ADTBL9_ADCH0_POSITION                   0x00000000
#define _ADTBL9_ADCH0_MASK                       0x00000001
#define _ADTBL9_ADCH0_LENGTH                     0x00000001

#define _ADTBL9_ADCH1_POSITION                   0x00000001
#define _ADTBL9_ADCH1_MASK                       0x00000002
#define _ADTBL9_ADCH1_LENGTH                     0x00000001

#define _ADTBL9_ADCH2_POSITION                   0x00000002
#define _ADTBL9_ADCH2_MASK                       0x00000004
#define _ADTBL9_ADCH2_LENGTH                     0x00000001

#define _ADTBL9_ADCH3_POSITION                   0x00000003
#define _ADTBL9_ADCH3_MASK                       0x00000008
#define _ADTBL9_ADCH3_LENGTH                     0x00000001

#define _ADTBL9_ADCH4_POSITION                   0x00000004
#define _ADTBL9_ADCH4_MASK                       0x00000010
#define _ADTBL9_ADCH4_LENGTH                     0x00000001

#define _ADTBL9_ADCH5_POSITION                   0x00000005
#define _ADTBL9_ADCH5_MASK                       0x00000020
#define _ADTBL9_ADCH5_LENGTH                     0x00000001

#define _ADTBL9_ADCH6_POSITION                   0x00000006
#define _ADTBL9_ADCH6_MASK                       0x00000040
#define _ADTBL9_ADCH6_LENGTH                     0x00000001

#define _ADTBL10_ADCH_POSITION                   0x00000000
#define _ADTBL10_ADCH_MASK                       0x0000007F
#define _ADTBL10_ADCH_LENGTH                     0x00000007

#define _ADTBL10_DIFF_POSITION                   0x0000000E
#define _ADTBL10_DIFF_MASK                       0x00004000
#define _ADTBL10_DIFF_LENGTH                     0x00000001

#define _ADTBL10_UCTMU_POSITION                  0x0000000F
#define _ADTBL10_UCTMU_MASK                      0x00008000
#define _ADTBL10_UCTMU_LENGTH                    0x00000001

#define _ADTBL10_ADCH0_POSITION                  0x00000000
#define _ADTBL10_ADCH0_MASK                      0x00000001
#define _ADTBL10_ADCH0_LENGTH                    0x00000001

#define _ADTBL10_ADCH1_POSITION                  0x00000001
#define _ADTBL10_ADCH1_MASK                      0x00000002
#define _ADTBL10_ADCH1_LENGTH                    0x00000001

#define _ADTBL10_ADCH2_POSITION                  0x00000002
#define _ADTBL10_ADCH2_MASK                      0x00000004
#define _ADTBL10_ADCH2_LENGTH                    0x00000001

#define _ADTBL10_ADCH3_POSITION                  0x00000003
#define _ADTBL10_ADCH3_MASK                      0x00000008
#define _ADTBL10_ADCH3_LENGTH                    0x00000001

#define _ADTBL10_ADCH4_POSITION                  0x00000004
#define _ADTBL10_ADCH4_MASK                      0x00000010
#define _ADTBL10_ADCH4_LENGTH                    0x00000001

#define _ADTBL10_ADCH5_POSITION                  0x00000005
#define _ADTBL10_ADCH5_MASK                      0x00000020
#define _ADTBL10_ADCH5_LENGTH                    0x00000001

#define _ADTBL10_ADCH6_POSITION                  0x00000006
#define _ADTBL10_ADCH6_MASK                      0x00000040
#define _ADTBL10_ADCH6_LENGTH                    0x00000001

#define _ADTBL11_ADCH_POSITION                   0x00000000
#define _ADTBL11_ADCH_MASK                       0x0000007F
#define _ADTBL11_ADCH_LENGTH                     0x00000007

#define _ADTBL11_DIFF_POSITION                   0x0000000E
#define _ADTBL11_DIFF_MASK                       0x00004000
#define _ADTBL11_DIFF_LENGTH                     0x00000001

#define _ADTBL11_UCTMU_POSITION                  0x0000000F
#define _ADTBL11_UCTMU_MASK                      0x00008000
#define _ADTBL11_UCTMU_LENGTH                    0x00000001

#define _ADTBL11_ADCH0_POSITION                  0x00000000
#define _ADTBL11_ADCH0_MASK                      0x00000001
#define _ADTBL11_ADCH0_LENGTH                    0x00000001

#define _ADTBL11_ADCH1_POSITION                  0x00000001
#define _ADTBL11_ADCH1_MASK                      0x00000002
#define _ADTBL11_ADCH1_LENGTH                    0x00000001

#define _ADTBL11_ADCH2_POSITION                  0x00000002
#define _ADTBL11_ADCH2_MASK                      0x00000004
#define _ADTBL11_ADCH2_LENGTH                    0x00000001

#define _ADTBL11_ADCH3_POSITION                  0x00000003
#define _ADTBL11_ADCH3_MASK                      0x00000008
#define _ADTBL11_ADCH3_LENGTH                    0x00000001

#define _ADTBL11_ADCH4_POSITION                  0x00000004
#define _ADTBL11_ADCH4_MASK                      0x00000010
#define _ADTBL11_ADCH4_LENGTH                    0x00000001

#define _ADTBL11_ADCH5_POSITION                  0x00000005
#define _ADTBL11_ADCH5_MASK                      0x00000020
#define _ADTBL11_ADCH5_LENGTH                    0x00000001

#define _ADTBL11_ADCH6_POSITION                  0x00000006
#define _ADTBL11_ADCH6_MASK                      0x00000040
#define _ADTBL11_ADCH6_LENGTH                    0x00000001

#define _ADTBL12_ADCH_POSITION                   0x00000000
#define _ADTBL12_ADCH_MASK                       0x0000007F
#define _ADTBL12_ADCH_LENGTH                     0x00000007

#define _ADTBL12_DIFF_POSITION                   0x0000000E
#define _ADTBL12_DIFF_MASK                       0x00004000
#define _ADTBL12_DIFF_LENGTH                     0x00000001

#define _ADTBL12_UCTMU_POSITION                  0x0000000F
#define _ADTBL12_UCTMU_MASK                      0x00008000
#define _ADTBL12_UCTMU_LENGTH                    0x00000001

#define _ADTBL12_ADCH0_POSITION                  0x00000000
#define _ADTBL12_ADCH0_MASK                      0x00000001
#define _ADTBL12_ADCH0_LENGTH                    0x00000001

#define _ADTBL12_ADCH1_POSITION                  0x00000001
#define _ADTBL12_ADCH1_MASK                      0x00000002
#define _ADTBL12_ADCH1_LENGTH                    0x00000001

#define _ADTBL12_ADCH2_POSITION                  0x00000002
#define _ADTBL12_ADCH2_MASK                      0x00000004
#define _ADTBL12_ADCH2_LENGTH                    0x00000001

#define _ADTBL12_ADCH3_POSITION                  0x00000003
#define _ADTBL12_ADCH3_MASK                      0x00000008
#define _ADTBL12_ADCH3_LENGTH                    0x00000001

