MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GC006/mcu.h
#define _ADTBL26_ADCH6_POSITION                  0x00000006
#define _ADTBL26_ADCH6_MASK                      0x00000040
#define _ADTBL26_ADCH6_LENGTH                    0x00000001

#define _ADTBL27_ADCH_POSITION                   0x00000000
#define _ADTBL27_ADCH_MASK                       0x0000007F
#define _ADTBL27_ADCH_LENGTH                     0x00000007

#define _ADTBL27_DIFF_POSITION                   0x0000000E
#define _ADTBL27_DIFF_MASK                       0x00004000
#define _ADTBL27_DIFF_LENGTH                     0x00000001

#define _ADTBL27_UCTMU_POSITION                  0x0000000F
#define _ADTBL27_UCTMU_MASK                      0x00008000
#define _ADTBL27_UCTMU_LENGTH                    0x00000001

#define _ADTBL27_ADCH0_POSITION                  0x00000000
#define _ADTBL27_ADCH0_MASK                      0x00000001
#define _ADTBL27_ADCH0_LENGTH                    0x00000001

#define _ADTBL27_ADCH1_POSITION                  0x00000001
#define _ADTBL27_ADCH1_MASK                      0x00000002
#define _ADTBL27_ADCH1_LENGTH                    0x00000001

#define _ADTBL27_ADCH2_POSITION                  0x00000002
#define _ADTBL27_ADCH2_MASK                      0x00000004
#define _ADTBL27_ADCH2_LENGTH                    0x00000001

#define _ADTBL27_ADCH3_POSITION                  0x00000003
#define _ADTBL27_ADCH3_MASK                      0x00000008
#define _ADTBL27_ADCH3_LENGTH                    0x00000001

#define _ADTBL27_ADCH4_POSITION                  0x00000004
#define _ADTBL27_ADCH4_MASK                      0x00000010
#define _ADTBL27_ADCH4_LENGTH                    0x00000001

#define _ADTBL27_ADCH5_POSITION                  0x00000005
#define _ADTBL27_ADCH5_MASK                      0x00000020
#define _ADTBL27_ADCH5_LENGTH                    0x00000001

#define _ADTBL27_ADCH6_POSITION                  0x00000006
#define _ADTBL27_ADCH6_MASK                      0x00000040
#define _ADTBL27_ADCH6_LENGTH                    0x00000001

#define _ADTBL28_ADCH_POSITION                   0x00000000
#define _ADTBL28_ADCH_MASK                       0x0000007F
#define _ADTBL28_ADCH_LENGTH                     0x00000007

#define _ADTBL28_DIFF_POSITION                   0x0000000E
#define _ADTBL28_DIFF_MASK                       0x00004000
#define _ADTBL28_DIFF_LENGTH                     0x00000001

#define _ADTBL28_UCTMU_POSITION                  0x0000000F
#define _ADTBL28_UCTMU_MASK                      0x00008000
#define _ADTBL28_UCTMU_LENGTH                    0x00000001

#define _ADTBL28_ADCH0_POSITION                  0x00000000
#define _ADTBL28_ADCH0_MASK                      0x00000001
#define _ADTBL28_ADCH0_LENGTH                    0x00000001

#define _ADTBL28_ADCH1_POSITION                  0x00000001
#define _ADTBL28_ADCH1_MASK                      0x00000002
#define _ADTBL28_ADCH1_LENGTH                    0x00000001

#define _ADTBL28_ADCH2_POSITION                  0x00000002
#define _ADTBL28_ADCH2_MASK                      0x00000004
#define _ADTBL28_ADCH2_LENGTH                    0x00000001

#define _ADTBL28_ADCH3_POSITION                  0x00000003
#define _ADTBL28_ADCH3_MASK                      0x00000008
#define _ADTBL28_ADCH3_LENGTH                    0x00000001

#define _ADTBL28_ADCH4_POSITION                  0x00000004
#define _ADTBL28_ADCH4_MASK                      0x00000010
#define _ADTBL28_ADCH4_LENGTH                    0x00000001

#define _ADTBL28_ADCH5_POSITION                  0x00000005
#define _ADTBL28_ADCH5_MASK                      0x00000020
#define _ADTBL28_ADCH5_LENGTH                    0x00000001

#define _ADTBL28_ADCH6_POSITION                  0x00000006
#define _ADTBL28_ADCH6_MASK                      0x00000040
#define _ADTBL28_ADCH6_LENGTH                    0x00000001

#define _ADTBL29_ADCH_POSITION                   0x00000000
#define _ADTBL29_ADCH_MASK                       0x0000007F
#define _ADTBL29_ADCH_LENGTH                     0x00000007

#define _ADTBL29_DIFF_POSITION                   0x0000000E
#define _ADTBL29_DIFF_MASK                       0x00004000
#define _ADTBL29_DIFF_LENGTH                     0x00000001

#define _ADTBL29_UCTMU_POSITION                  0x0000000F
#define _ADTBL29_UCTMU_MASK                      0x00008000
#define _ADTBL29_UCTMU_LENGTH                    0x00000001

#define _ADTBL29_ADCH0_POSITION                  0x00000000
#define _ADTBL29_ADCH0_MASK                      0x00000001
#define _ADTBL29_ADCH0_LENGTH                    0x00000001

#define _ADTBL29_ADCH1_POSITION                  0x00000001
#define _ADTBL29_ADCH1_MASK                      0x00000002
#define _ADTBL29_ADCH1_LENGTH                    0x00000001

#define _ADTBL29_ADCH2_POSITION                  0x00000002
#define _ADTBL29_ADCH2_MASK                      0x00000004
#define _ADTBL29_ADCH2_LENGTH                    0x00000001

#define _ADTBL29_ADCH3_POSITION                  0x00000003
#define _ADTBL29_ADCH3_MASK                      0x00000008
#define _ADTBL29_ADCH3_LENGTH                    0x00000001

#define _ADTBL29_ADCH4_POSITION                  0x00000004
#define _ADTBL29_ADCH4_MASK                      0x00000010
#define _ADTBL29_ADCH4_LENGTH                    0x00000001

#define _ADTBL29_ADCH5_POSITION                  0x00000005
#define _ADTBL29_ADCH5_MASK                      0x00000020
#define _ADTBL29_ADCH5_LENGTH                    0x00000001

#define _ADTBL29_ADCH6_POSITION                  0x00000006
#define _ADTBL29_ADCH6_MASK                      0x00000040
#define _ADTBL29_ADCH6_LENGTH                    0x00000001

#define _ADTBL30_ADCH_POSITION                   0x00000000
#define _ADTBL30_ADCH_MASK                       0x0000007F
#define _ADTBL30_ADCH_LENGTH                     0x00000007

#define _ADTBL30_DIFF_POSITION                   0x0000000E
#define _ADTBL30_DIFF_MASK                       0x00004000
#define _ADTBL30_DIFF_LENGTH                     0x00000001

#define _ADTBL30_UCTMU_POSITION                  0x0000000F
#define _ADTBL30_UCTMU_MASK                      0x00008000
#define _ADTBL30_UCTMU_LENGTH                    0x00000001

#define _ADTBL30_ADCH0_POSITION                  0x00000000
#define _ADTBL30_ADCH0_MASK                      0x00000001
#define _ADTBL30_ADCH0_LENGTH                    0x00000001

#define _ADTBL30_ADCH1_POSITION                  0x00000001
#define _ADTBL30_ADCH1_MASK                      0x00000002
#define _ADTBL30_ADCH1_LENGTH                    0x00000001

#define _ADTBL30_ADCH2_POSITION                  0x00000002
#define _ADTBL30_ADCH2_MASK                      0x00000004
#define _ADTBL30_ADCH2_LENGTH                    0x00000001

#define _ADTBL30_ADCH3_POSITION                  0x00000003
#define _ADTBL30_ADCH3_MASK                      0x00000008
#define _ADTBL30_ADCH3_LENGTH                    0x00000001

#define _ADTBL30_ADCH4_POSITION                  0x00000004
#define _ADTBL30_ADCH4_MASK                      0x00000010
#define _ADTBL30_ADCH4_LENGTH                    0x00000001

#define _ADTBL30_ADCH5_POSITION                  0x00000005
#define _ADTBL30_ADCH5_MASK                      0x00000020
#define _ADTBL30_ADCH5_LENGTH                    0x00000001

