MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GC006/mcu.h
#define _ANSF_ANSF4_POSITION                     0x00000004
#define _ANSF_ANSF4_MASK                         0x00000010
#define _ANSF_ANSF4_LENGTH                       0x00000001

#define _ANSF_ANSF5_POSITION                     0x00000005
#define _ANSF_ANSF5_MASK                         0x00000020
#define _ANSF_ANSF5_LENGTH                       0x00000001

#define _ANSF_ANSF7_POSITION                     0x00000007
#define _ANSF_ANSF7_MASK                         0x00000080
#define _ANSF_ANSF7_LENGTH                       0x00000001

#define _ANSF_ANSELF0_POSITION                   0x00000000
#define _ANSF_ANSELF0_MASK                       0x00000001
#define _ANSF_ANSELF0_LENGTH                     0x00000001

#define _ANSF_ANSELF3_POSITION                   0x00000003
#define _ANSF_ANSELF3_MASK                       0x00000008
#define _ANSF_ANSELF3_LENGTH                     0x00000001

#define _ANSF_ANSELF4_POSITION                   0x00000004
#define _ANSF_ANSELF4_MASK                       0x00000010
#define _ANSF_ANSELF4_LENGTH                     0x00000001

#define _ANSF_ANSELF5_POSITION                   0x00000005
#define _ANSF_ANSELF5_MASK                       0x00000020
#define _ANSF_ANSELF5_LENGTH                     0x00000001

#define _ANSF_ANSELF7_POSITION                   0x00000007
#define _ANSF_ANSELF7_MASK                       0x00000080
#define _ANSF_ANSELF7_LENGTH                     0x00000001

#define _ANSELG_ANSG6_POSITION                   0x00000006
#define _ANSELG_ANSG6_MASK                       0x00000040
#define _ANSELG_ANSG6_LENGTH                     0x00000001

#define _ANSELG_ANSG7_POSITION                   0x00000007
#define _ANSELG_ANSG7_MASK                       0x00000080
#define _ANSELG_ANSG7_LENGTH                     0x00000001

#define _ANSELG_ANSG8_POSITION                   0x00000008
#define _ANSELG_ANSG8_MASK                       0x00000100
#define _ANSELG_ANSG8_LENGTH                     0x00000001

#define _ANSELG_ANSG9_POSITION                   0x00000009
#define _ANSELG_ANSG9_MASK                       0x00000200
#define _ANSELG_ANSG9_LENGTH                     0x00000001

#define _ANSELG_ANSELG6_POSITION                 0x00000006
#define _ANSELG_ANSELG6_MASK                     0x00000040
#define _ANSELG_ANSELG6_LENGTH                   0x00000001

#define _ANSELG_ANSELG7_POSITION                 0x00000007
#define _ANSELG_ANSELG7_MASK                     0x00000080
#define _ANSELG_ANSELG7_LENGTH                   0x00000001

#define _ANSELG_ANSELG8_POSITION                 0x00000008
#define _ANSELG_ANSELG8_MASK                     0x00000100
#define _ANSELG_ANSELG8_LENGTH                   0x00000001

#define _ANSELG_ANSELG9_POSITION                 0x00000009
#define _ANSELG_ANSELG9_MASK                     0x00000200
#define _ANSELG_ANSELG9_LENGTH                   0x00000001

#define _ANSG_ANSG6_POSITION                     0x00000006
#define _ANSG_ANSG6_MASK                         0x00000040
#define _ANSG_ANSG6_LENGTH                       0x00000001

#define _ANSG_ANSG7_POSITION                     0x00000007
#define _ANSG_ANSG7_MASK                         0x00000080
#define _ANSG_ANSG7_LENGTH                       0x00000001

#define _ANSG_ANSG8_POSITION                     0x00000008
#define _ANSG_ANSG8_MASK                         0x00000100
#define _ANSG_ANSG8_LENGTH                       0x00000001

#define _ANSG_ANSG9_POSITION                     0x00000009
#define _ANSG_ANSG9_MASK                         0x00000200
#define _ANSG_ANSG9_LENGTH                       0x00000001

#define _ANSG_ANSELG6_POSITION                   0x00000006
#define _ANSG_ANSELG6_MASK                       0x00000040
#define _ANSG_ANSELG6_LENGTH                     0x00000001

#define _ANSG_ANSELG7_POSITION                   0x00000007
#define _ANSG_ANSELG7_MASK                       0x00000080
#define _ANSG_ANSELG7_LENGTH                     0x00000001

#define _ANSG_ANSELG8_POSITION                   0x00000008
#define _ANSG_ANSELG8_MASK                       0x00000100
#define _ANSG_ANSELG8_LENGTH                     0x00000001

#define _ANSG_ANSELG9_POSITION                   0x00000009
#define _ANSG_ANSELG9_MASK                       0x00000200
#define _ANSG_ANSELG9_LENGTH                     0x00000001

#define _ADCON1_PWRLVL_POSITION                  0x00000000
#define _ADCON1_PWRLVL_MASK                      0x00000001
#define _ADCON1_PWRLVL_LENGTH                    0x00000001

#define _ADCON1_ADCAL_POSITION                   0x00000006
#define _ADCON1_ADCAL_MASK                       0x00000040
#define _ADCON1_ADCAL_LENGTH                     0x00000001

#define _ADCON1_PUMPEN_POSITION                  0x00000007
#define _ADCON1_PUMPEN_MASK                      0x00000080
#define _ADCON1_PUMPEN_LENGTH                    0x00000001

#define _ADCON1_FORM_POSITION                    0x00000008
#define _ADCON1_FORM_MASK                        0x00000F00
#define _ADCON1_FORM_LENGTH                      0x00000004

#define _ADCON1_ADSLP_POSITION                   0x0000000C
#define _ADCON1_ADSLP_MASK                       0x00001000
#define _ADCON1_ADSLP_LENGTH                     0x00000001

#define _ADCON1_ADSIDL_POSITION                  0x0000000D
#define _ADCON1_ADSIDL_MASK                      0x00002000
#define _ADCON1_ADSIDL_LENGTH                    0x00000001

#define _ADCON1_ADON_POSITION                    0x0000000F
#define _ADCON1_ADON_MASK                        0x00008000
#define _ADCON1_ADON_LENGTH                      0x00000001

#define _ADCON1_FORM0_POSITION                   0x00000008
#define _ADCON1_FORM0_MASK                       0x00000100
#define _ADCON1_FORM0_LENGTH                     0x00000001

#define _ADCON1_FORM1_POSITION                   0x00000009
#define _ADCON1_FORM1_MASK                       0x00000200
#define _ADCON1_FORM1_LENGTH                     0x00000001

#define _ADCON1_FORM2_POSITION                   0x0000000A
#define _ADCON1_FORM2_MASK                       0x00000400
#define _ADCON1_FORM2_LENGTH                     0x00000001

#define _ADCON1_FORM3_POSITION                   0x0000000B
#define _ADCON1_FORM3_MASK                       0x00000800
#define _ADCON1_FORM3_LENGTH                     0x00000001

#define _ADCON2_ADHALT_POSITION                  0x00000000
#define _ADCON2_ADHALT_MASK                      0x00000001
#define _ADCON2_ADHALT_LENGTH                    0x00000001

#define _ADCON2_REFPUMP_POSITION                 0x00000001
#define _ADCON2_REFPUMP_MASK                     0x00000002
#define _ADCON2_REFPUMP_LENGTH                   0x00000001

#define _ADCON2_BUFORG_POSITION                  0x0000000A
#define _ADCON2_BUFORG_MASK                      0x00000400
#define _ADCON2_BUFORG_LENGTH                    0x00000001

#define _ADCON2_NVCFG0_POSITION                  0x0000000C
#define _ADCON2_NVCFG0_MASK                      0x00001000
#define _ADCON2_NVCFG0_LENGTH                    0x00000001

#define _ADCON2_PVCFG_POSITION                   0x0000000E
#define _ADCON2_PVCFG_MASK                       0x0000C000
#define _ADCON2_PVCFG_LENGTH                     0x00000002

#define _ADCON2_NVCFG_POSITION                   0x0000000C
#define _ADCON2_NVCFG_MASK                       0x00001000
#define _ADCON2_NVCFG_LENGTH                     0x00000001

