MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GC006/mcu.h
#define _ADTH2H_TH8_POSITION                     0x00000008
#define _ADTH2H_TH8_MASK                         0x00000100
#define _ADTH2H_TH8_LENGTH                       0x00000001

#define _ADTH2H_TH9_POSITION                     0x00000009
#define _ADTH2H_TH9_MASK                         0x00000200
#define _ADTH2H_TH9_LENGTH                       0x00000001

#define _ADTH2H_TH10_POSITION                    0x0000000A
#define _ADTH2H_TH10_MASK                        0x00000400
#define _ADTH2H_TH10_LENGTH                      0x00000001

#define _ADTH2H_TH11_POSITION                    0x0000000B
#define _ADTH2H_TH11_MASK                        0x00000800
#define _ADTH2H_TH11_LENGTH                      0x00000001

#define _ADTH2H_TH12_POSITION                    0x0000000C
#define _ADTH2H_TH12_MASK                        0x00001000
#define _ADTH2H_TH12_LENGTH                      0x00000001

#define _ADTH2H_TH13_POSITION                    0x0000000D
#define _ADTH2H_TH13_MASK                        0x00002000
#define _ADTH2H_TH13_LENGTH                      0x00000001

#define _ADTH2H_TH14_POSITION                    0x0000000E
#define _ADTH2H_TH14_MASK                        0x00004000
#define _ADTH2H_TH14_LENGTH                      0x00000001

#define _ADTH2H_TH15_POSITION                    0x0000000F
#define _ADTH2H_TH15_MASK                        0x00008000
#define _ADTH2H_TH15_LENGTH                      0x00000001

#define _ADL2MSEL0_MSEL15_POSITION               0x0000000F
#define _ADL2MSEL0_MSEL15_MASK                   0x00008000
#define _ADL2MSEL0_MSEL15_LENGTH                 0x00000001

#define _ADL2MSEL1_MSEL16_POSITION               0x00000000
#define _ADL2MSEL1_MSEL16_MASK                   0x00000001
#define _ADL2MSEL1_MSEL16_LENGTH                 0x00000001

#define _ADL2MSEL1_MSEL17_POSITION               0x00000001
#define _ADL2MSEL1_MSEL17_MASK                   0x00000002
#define _ADL2MSEL1_MSEL17_LENGTH                 0x00000001

#define _ADL2MSEL1_MSEL18_POSITION               0x00000002
#define _ADL2MSEL1_MSEL18_MASK                   0x00000004
#define _ADL2MSEL1_MSEL18_LENGTH                 0x00000001

#define _ADL2MSEL1_MSEL19_POSITION               0x00000003
#define _ADL2MSEL1_MSEL19_MASK                   0x00000008
#define _ADL2MSEL1_MSEL19_LENGTH                 0x00000001

#define _ADL2MSEL1_MSEL20_POSITION               0x00000004
#define _ADL2MSEL1_MSEL20_MASK                   0x00000010
#define _ADL2MSEL1_MSEL20_LENGTH                 0x00000001

#define _ADL2MSEL1_MSEL21_POSITION               0x00000005
#define _ADL2MSEL1_MSEL21_MASK                   0x00000020
#define _ADL2MSEL1_MSEL21_LENGTH                 0x00000001

#define _ADL2MSEL1_MSEL22_POSITION               0x00000006
#define _ADL2MSEL1_MSEL22_MASK                   0x00000040
#define _ADL2MSEL1_MSEL22_LENGTH                 0x00000001

#define _ADL2MSEL1_MSEL23_POSITION               0x00000007
#define _ADL2MSEL1_MSEL23_MASK                   0x00000080
#define _ADL2MSEL1_MSEL23_LENGTH                 0x00000001

#define _ADL2MSEL1_MSEL24_POSITION               0x00000008
#define _ADL2MSEL1_MSEL24_MASK                   0x00000100
#define _ADL2MSEL1_MSEL24_LENGTH                 0x00000001

#define _ADL2MSEL1_MSEL25_POSITION               0x00000009
#define _ADL2MSEL1_MSEL25_MASK                   0x00000200
#define _ADL2MSEL1_MSEL25_LENGTH                 0x00000001

#define _ADL2MSEL1_MSEL26_POSITION               0x0000000A
#define _ADL2MSEL1_MSEL26_MASK                   0x00000400
#define _ADL2MSEL1_MSEL26_LENGTH                 0x00000001

#define _ADL2MSEL1_MSEL27_POSITION               0x0000000B
#define _ADL2MSEL1_MSEL27_MASK                   0x00000800
#define _ADL2MSEL1_MSEL27_LENGTH                 0x00000001

#define _ADL2MSEL1_MSEL28_POSITION               0x0000000C
#define _ADL2MSEL1_MSEL28_MASK                   0x00001000
#define _ADL2MSEL1_MSEL28_LENGTH                 0x00000001

#define _ADL2MSEL1_MSEL29_POSITION               0x0000000D
#define _ADL2MSEL1_MSEL29_MASK                   0x00002000
#define _ADL2MSEL1_MSEL29_LENGTH                 0x00000001

#define _ADL2MSEL1_MSEL30_POSITION               0x0000000E
#define _ADL2MSEL1_MSEL30_MASK                   0x00004000
#define _ADL2MSEL1_MSEL30_LENGTH                 0x00000001

#define _ADL2MSEL1_MSEL31_POSITION               0x0000000F
#define _ADL2MSEL1_MSEL31_MASK                   0x00008000
#define _ADL2MSEL1_MSEL31_LENGTH                 0x00000001

#define _ADL2MSEL2_MSEL32_POSITION               0x00000000
#define _ADL2MSEL2_MSEL32_MASK                   0x00000001
#define _ADL2MSEL2_MSEL32_LENGTH                 0x00000001

#define _ADL2MSEL2_MSEL33_POSITION               0x00000001
#define _ADL2MSEL2_MSEL33_MASK                   0x00000002
#define _ADL2MSEL2_MSEL33_LENGTH                 0x00000001

#define _ADL2MSEL2_MSEL34_POSITION               0x00000002
#define _ADL2MSEL2_MSEL34_MASK                   0x00000004
#define _ADL2MSEL2_MSEL34_LENGTH                 0x00000001

#define _ADL2MSEL2_MSEL35_POSITION               0x00000003
#define _ADL2MSEL2_MSEL35_MASK                   0x00000008
#define _ADL2MSEL2_MSEL35_LENGTH                 0x00000001

#define _ADL2MSEL2_MSEL36_POSITION               0x00000004
#define _ADL2MSEL2_MSEL36_MASK                   0x00000010
#define _ADL2MSEL2_MSEL36_LENGTH                 0x00000001

#define _ADL2MSEL2_MSEL37_POSITION               0x00000005
#define _ADL2MSEL2_MSEL37_MASK                   0x00000020
#define _ADL2MSEL2_MSEL37_LENGTH                 0x00000001

#define _ADL2MSEL2_MSEL38_POSITION               0x00000006
#define _ADL2MSEL2_MSEL38_MASK                   0x00000040
#define _ADL2MSEL2_MSEL38_LENGTH                 0x00000001

#define _ADL2MSEL2_MSEL39_POSITION               0x00000007
#define _ADL2MSEL2_MSEL39_MASK                   0x00000080
#define _ADL2MSEL2_MSEL39_LENGTH                 0x00000001

#define _ADL2MSEL2_MSEL40_POSITION               0x00000008
#define _ADL2MSEL2_MSEL40_MASK                   0x00000100
#define _ADL2MSEL2_MSEL40_LENGTH                 0x00000001

#define _ADL2MSEL2_MSEL41_POSITION               0x00000009
#define _ADL2MSEL2_MSEL41_MASK                   0x00000200
#define _ADL2MSEL2_MSEL41_LENGTH                 0x00000001

#define _ADL2MSEL2_MSEL42_POSITION               0x0000000A
#define _ADL2MSEL2_MSEL42_MASK                   0x00000400
#define _ADL2MSEL2_MSEL42_LENGTH                 0x00000001

