MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GC006/mcu.h
#define _LCDCON_CS_POSITION                      0x00000003
#define _LCDCON_CS_MASK                          0x00000018
#define _LCDCON_CS_LENGTH                        0x00000002

#define _LCDCON_WERR_POSITION                    0x00000005
#define _LCDCON_WERR_MASK                        0x00000020
#define _LCDCON_WERR_LENGTH                      0x00000001

#define _LCDCON_SLPEN_POSITION                   0x00000006
#define _LCDCON_SLPEN_MASK                       0x00000040
#define _LCDCON_SLPEN_LENGTH                     0x00000001

#define _LCDCON_LCDSIDL_POSITION                 0x0000000D
#define _LCDCON_LCDSIDL_MASK                     0x00002000
#define _LCDCON_LCDSIDL_LENGTH                   0x00000001

#define _LCDCON_LCDEN_POSITION                   0x0000000F
#define _LCDCON_LCDEN_MASK                       0x00008000
#define _LCDCON_LCDEN_LENGTH                     0x00000001

#define _LCDCON_LMUX0_POSITION                   0x00000000
#define _LCDCON_LMUX0_MASK                       0x00000001
#define _LCDCON_LMUX0_LENGTH                     0x00000001

#define _LCDCON_LMUX1_POSITION                   0x00000001
#define _LCDCON_LMUX1_MASK                       0x00000002
#define _LCDCON_LMUX1_LENGTH                     0x00000001

#define _LCDCON_LMUX2_POSITION                   0x00000002
#define _LCDCON_LMUX2_MASK                       0x00000004
#define _LCDCON_LMUX2_LENGTH                     0x00000001

#define _LCDCON_CS0_POSITION                     0x00000003
#define _LCDCON_CS0_MASK                         0x00000008
#define _LCDCON_CS0_LENGTH                       0x00000001

#define _LCDCON_CS1_POSITION                     0x00000004
#define _LCDCON_CS1_MASK                         0x00000010
#define _LCDCON_CS1_LENGTH                       0x00000001

#define _LCDPS_LP_POSITION                       0x00000000
#define _LCDPS_LP_MASK                           0x0000000F
#define _LCDPS_LP_LENGTH                         0x00000004

#define _LCDPS_WA_POSITION                       0x00000004
#define _LCDPS_WA_MASK                           0x00000010
#define _LCDPS_WA_LENGTH                         0x00000001

#define _LCDPS_LCDA_POSITION                     0x00000005
#define _LCDPS_LCDA_MASK                         0x00000020
#define _LCDPS_LCDA_LENGTH                       0x00000001

#define _LCDPS_BIASMD_POSITION                   0x00000006
#define _LCDPS_BIASMD_MASK                       0x00000040
#define _LCDPS_BIASMD_LENGTH                     0x00000001

#define _LCDPS_WFT_POSITION                      0x00000007
#define _LCDPS_WFT_MASK                          0x00000080
#define _LCDPS_WFT_LENGTH                        0x00000001

#define _LCDPS_LP0_POSITION                      0x00000000
#define _LCDPS_LP0_MASK                          0x00000001
#define _LCDPS_LP0_LENGTH                        0x00000001

#define _LCDPS_LP1_POSITION                      0x00000001
#define _LCDPS_LP1_MASK                          0x00000002
#define _LCDPS_LP1_LENGTH                        0x00000001

#define _LCDPS_LP2_POSITION                      0x00000002
#define _LCDPS_LP2_MASK                          0x00000004
#define _LCDPS_LP2_LENGTH                        0x00000001

#define _LCDPS_LP3_POSITION                      0x00000003
#define _LCDPS_LP3_MASK                          0x00000008
#define _LCDPS_LP3_LENGTH                        0x00000001

#define _LCDSE0_SE00_POSITION                    0x00000000
#define _LCDSE0_SE00_MASK                        0x00000001
#define _LCDSE0_SE00_LENGTH                      0x00000001

#define _LCDSE0_SE01_POSITION                    0x00000001
#define _LCDSE0_SE01_MASK                        0x00000002
#define _LCDSE0_SE01_LENGTH                      0x00000001

#define _LCDSE0_SE02_POSITION                    0x00000002
#define _LCDSE0_SE02_MASK                        0x00000004
#define _LCDSE0_SE02_LENGTH                      0x00000001

#define _LCDSE0_SE03_POSITION                    0x00000003
#define _LCDSE0_SE03_MASK                        0x00000008
#define _LCDSE0_SE03_LENGTH                      0x00000001

#define _LCDSE0_SE04_POSITION                    0x00000004
#define _LCDSE0_SE04_MASK                        0x00000010
#define _LCDSE0_SE04_LENGTH                      0x00000001

#define _LCDSE0_SE05_POSITION                    0x00000005
#define _LCDSE0_SE05_MASK                        0x00000020
#define _LCDSE0_SE05_LENGTH                      0x00000001

#define _LCDSE0_SE06_POSITION                    0x00000006
#define _LCDSE0_SE06_MASK                        0x00000040
#define _LCDSE0_SE06_LENGTH                      0x00000001

#define _LCDSE0_SE07_POSITION                    0x00000007
#define _LCDSE0_SE07_MASK                        0x00000080
#define _LCDSE0_SE07_LENGTH                      0x00000001

#define _LCDSE0_SE08_POSITION                    0x00000008
#define _LCDSE0_SE08_MASK                        0x00000100
#define _LCDSE0_SE08_LENGTH                      0x00000001

#define _LCDSE0_SE09_POSITION                    0x00000009
#define _LCDSE0_SE09_MASK                        0x00000200
#define _LCDSE0_SE09_LENGTH                      0x00000001

#define _LCDSE0_SE10_POSITION                    0x0000000A
#define _LCDSE0_SE10_MASK                        0x00000400
#define _LCDSE0_SE10_LENGTH                      0x00000001

#define _LCDSE0_SE11_POSITION                    0x0000000B
#define _LCDSE0_SE11_MASK                        0x00000800
#define _LCDSE0_SE11_LENGTH                      0x00000001

#define _LCDSE0_SE12_POSITION                    0x0000000C
#define _LCDSE0_SE12_MASK                        0x00001000
#define _LCDSE0_SE12_LENGTH                      0x00000001

#define _LCDSE0_SE13_POSITION                    0x0000000D
#define _LCDSE0_SE13_MASK                        0x00002000
#define _LCDSE0_SE13_LENGTH                      0x00000001

#define _LCDSE0_SE14_POSITION                    0x0000000E
#define _LCDSE0_SE14_MASK                        0x00004000
#define _LCDSE0_SE14_LENGTH                      0x00000001

#define _LCDSE0_SE15_POSITION                    0x0000000F
#define _LCDSE0_SE15_MASK                        0x00008000
#define _LCDSE0_SE15_LENGTH                      0x00000001

#define _LCDSE1_SE16_POSITION                    0x00000000
#define _LCDSE1_SE16_MASK                        0x00000001
#define _LCDSE1_SE16_LENGTH                      0x00000001

#define _LCDSE1_SE17_POSITION                    0x00000001
#define _LCDSE1_SE17_MASK                        0x00000002
#define _LCDSE1_SE17_LENGTH                      0x00000001

#define _LCDSE1_SE18_POSITION                    0x00000002
#define _LCDSE1_SE18_MASK                        0x00000004
#define _LCDSE1_SE18_LENGTH                      0x00000001

