MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GC006/mcu.h
#define _LCDSE1_SE19_POSITION                    0x00000003
#define _LCDSE1_SE19_MASK                        0x00000008
#define _LCDSE1_SE19_LENGTH                      0x00000001

#define _LCDSE1_SE20_POSITION                    0x00000004
#define _LCDSE1_SE20_MASK                        0x00000010
#define _LCDSE1_SE20_LENGTH                      0x00000001

#define _LCDSE1_SE21_POSITION                    0x00000005
#define _LCDSE1_SE21_MASK                        0x00000020
#define _LCDSE1_SE21_LENGTH                      0x00000001

#define _LCDSE1_SE22_POSITION                    0x00000006
#define _LCDSE1_SE22_MASK                        0x00000040
#define _LCDSE1_SE22_LENGTH                      0x00000001

#define _LCDSE1_SE23_POSITION                    0x00000007
#define _LCDSE1_SE23_MASK                        0x00000080
#define _LCDSE1_SE23_LENGTH                      0x00000001

#define _LCDSE1_SE24_POSITION                    0x00000008
#define _LCDSE1_SE24_MASK                        0x00000100
#define _LCDSE1_SE24_LENGTH                      0x00000001

#define _LCDSE1_SE25_POSITION                    0x00000009
#define _LCDSE1_SE25_MASK                        0x00000200
#define _LCDSE1_SE25_LENGTH                      0x00000001

#define _LCDSE1_SE26_POSITION                    0x0000000A
#define _LCDSE1_SE26_MASK                        0x00000400
#define _LCDSE1_SE26_LENGTH                      0x00000001

#define _LCDSE1_SE27_POSITION                    0x0000000B
#define _LCDSE1_SE27_MASK                        0x00000800
#define _LCDSE1_SE27_LENGTH                      0x00000001

#define _LCDSE1_SE30_POSITION                    0x0000000E
#define _LCDSE1_SE30_MASK                        0x00004000
#define _LCDSE1_SE30_LENGTH                      0x00000001

#define _LCDSE2_SE47_POSITION                    0x0000000F
#define _LCDSE2_SE47_MASK                        0x00008000
#define _LCDSE2_SE47_LENGTH                      0x00000001

#define _LCDSE3_SE48_POSITION                    0x00000000
#define _LCDSE3_SE48_MASK                        0x00000001
#define _LCDSE3_SE48_LENGTH                      0x00000001

#define _LCDSE3_SE62_POSITION                    0x0000000E
#define _LCDSE3_SE62_MASK                        0x00004000
#define _LCDSE3_SE62_LENGTH                      0x00000001

#define _LCDDATA0_S00C0_POSITION                 0x00000000
#define _LCDDATA0_S00C0_MASK                     0x00000001
#define _LCDDATA0_S00C0_LENGTH                   0x00000001

#define _LCDDATA0_S01C0_POSITION                 0x00000001
#define _LCDDATA0_S01C0_MASK                     0x00000002
#define _LCDDATA0_S01C0_LENGTH                   0x00000001

#define _LCDDATA0_S02C0_POSITION                 0x00000002
#define _LCDDATA0_S02C0_MASK                     0x00000004
#define _LCDDATA0_S02C0_LENGTH                   0x00000001

#define _LCDDATA0_S03C0_POSITION                 0x00000003
#define _LCDDATA0_S03C0_MASK                     0x00000008
#define _LCDDATA0_S03C0_LENGTH                   0x00000001

#define _LCDDATA0_S04C0_POSITION                 0x00000004
#define _LCDDATA0_S04C0_MASK                     0x00000010
#define _LCDDATA0_S04C0_LENGTH                   0x00000001

#define _LCDDATA0_S05C0_POSITION                 0x00000005
#define _LCDDATA0_S05C0_MASK                     0x00000020
#define _LCDDATA0_S05C0_LENGTH                   0x00000001

#define _LCDDATA0_S06C0_POSITION                 0x00000006
#define _LCDDATA0_S06C0_MASK                     0x00000040
#define _LCDDATA0_S06C0_LENGTH                   0x00000001

#define _LCDDATA0_S07C0_POSITION                 0x00000007
#define _LCDDATA0_S07C0_MASK                     0x00000080
#define _LCDDATA0_S07C0_LENGTH                   0x00000001

#define _LCDDATA0_S08C0_POSITION                 0x00000008
#define _LCDDATA0_S08C0_MASK                     0x00000100
#define _LCDDATA0_S08C0_LENGTH                   0x00000001

#define _LCDDATA0_S09C0_POSITION                 0x00000009
#define _LCDDATA0_S09C0_MASK                     0x00000200
#define _LCDDATA0_S09C0_LENGTH                   0x00000001

#define _LCDDATA0_S10C0_POSITION                 0x0000000A
#define _LCDDATA0_S10C0_MASK                     0x00000400
#define _LCDDATA0_S10C0_LENGTH                   0x00000001

#define _LCDDATA0_S11C0_POSITION                 0x0000000B
#define _LCDDATA0_S11C0_MASK                     0x00000800
#define _LCDDATA0_S11C0_LENGTH                   0x00000001

#define _LCDDATA0_S12C0_POSITION                 0x0000000C
#define _LCDDATA0_S12C0_MASK                     0x00001000
#define _LCDDATA0_S12C0_LENGTH                   0x00000001

#define _LCDDATA0_S13C0_POSITION                 0x0000000D
#define _LCDDATA0_S13C0_MASK                     0x00002000
#define _LCDDATA0_S13C0_LENGTH                   0x00000001

#define _LCDDATA0_S14C0_POSITION                 0x0000000E
#define _LCDDATA0_S14C0_MASK                     0x00004000
#define _LCDDATA0_S14C0_LENGTH                   0x00000001

#define _LCDDATA0_S15C0_POSITION                 0x0000000F
#define _LCDDATA0_S15C0_MASK                     0x00008000
#define _LCDDATA0_S15C0_LENGTH                   0x00000001

#define _LCDDATA1_S16C0_POSITION                 0x00000000
#define _LCDDATA1_S16C0_MASK                     0x00000001
#define _LCDDATA1_S16C0_LENGTH                   0x00000001

#define _LCDDATA1_S17C0_POSITION                 0x00000001
#define _LCDDATA1_S17C0_MASK                     0x00000002
#define _LCDDATA1_S17C0_LENGTH                   0x00000001

#define _LCDDATA1_S18C0_POSITION                 0x00000002
#define _LCDDATA1_S18C0_MASK                     0x00000004
#define _LCDDATA1_S18C0_LENGTH                   0x00000001

#define _LCDDATA1_S19C0_POSITION                 0x00000003
#define _LCDDATA1_S19C0_MASK                     0x00000008
#define _LCDDATA1_S19C0_LENGTH                   0x00000001

#define _LCDDATA1_S20C0_POSITION                 0x00000004
#define _LCDDATA1_S20C0_MASK                     0x00000010
#define _LCDDATA1_S20C0_LENGTH                   0x00000001

