MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GC006/mcu.h
#define _LCDDATA9_S27C2_POSITION                 0x0000000B
#define _LCDDATA9_S27C2_MASK                     0x00000800
#define _LCDDATA9_S27C2_LENGTH                   0x00000001

#define _LCDDATA9_S30C2_POSITION                 0x0000000E
#define _LCDDATA9_S30C2_MASK                     0x00004000
#define _LCDDATA9_S30C2_LENGTH                   0x00000001

#define _LCDDATA10_S47C2_POSITION                0x0000000F
#define _LCDDATA10_S47C2_MASK                    0x00008000
#define _LCDDATA10_S47C2_LENGTH                  0x00000001

#define _LCDDATA11_S48C2_POSITION                0x00000000
#define _LCDDATA11_S48C2_MASK                    0x00000001
#define _LCDDATA11_S48C2_LENGTH                  0x00000001

#define _LCDDATA11_S62C2_POSITION                0x0000000E
#define _LCDDATA11_S62C2_MASK                    0x00004000
#define _LCDDATA11_S62C2_LENGTH                  0x00000001

#define _LCDDATA12_S00C3_POSITION                0x00000000
#define _LCDDATA12_S00C3_MASK                    0x00000001
#define _LCDDATA12_S00C3_LENGTH                  0x00000001

#define _LCDDATA12_S01C3_POSITION                0x00000001
#define _LCDDATA12_S01C3_MASK                    0x00000002
#define _LCDDATA12_S01C3_LENGTH                  0x00000001

#define _LCDDATA12_S02C3_POSITION                0x00000002
#define _LCDDATA12_S02C3_MASK                    0x00000004
#define _LCDDATA12_S02C3_LENGTH                  0x00000001

#define _LCDDATA12_S03C3_POSITION                0x00000003
#define _LCDDATA12_S03C3_MASK                    0x00000008
#define _LCDDATA12_S03C3_LENGTH                  0x00000001

#define _LCDDATA12_S04C3_POSITION                0x00000004
#define _LCDDATA12_S04C3_MASK                    0x00000010
#define _LCDDATA12_S04C3_LENGTH                  0x00000001

#define _LCDDATA12_S05C3_POSITION                0x00000005
#define _LCDDATA12_S05C3_MASK                    0x00000020
#define _LCDDATA12_S05C3_LENGTH                  0x00000001

#define _LCDDATA12_S06C3_POSITION                0x00000006
#define _LCDDATA12_S06C3_MASK                    0x00000040
#define _LCDDATA12_S06C3_LENGTH                  0x00000001

#define _LCDDATA12_S07C3_POSITION                0x00000007
#define _LCDDATA12_S07C3_MASK                    0x00000080
#define _LCDDATA12_S07C3_LENGTH                  0x00000001

#define _LCDDATA12_S08C3_POSITION                0x00000008
#define _LCDDATA12_S08C3_MASK                    0x00000100
#define _LCDDATA12_S08C3_LENGTH                  0x00000001

#define _LCDDATA12_S09C3_POSITION                0x00000009
#define _LCDDATA12_S09C3_MASK                    0x00000200
#define _LCDDATA12_S09C3_LENGTH                  0x00000001

#define _LCDDATA12_S10C3_POSITION                0x0000000A
#define _LCDDATA12_S10C3_MASK                    0x00000400
#define _LCDDATA12_S10C3_LENGTH                  0x00000001

#define _LCDDATA12_S11C3_POSITION                0x0000000B
#define _LCDDATA12_S11C3_MASK                    0x00000800
#define _LCDDATA12_S11C3_LENGTH                  0x00000001

#define _LCDDATA12_S12C3_POSITION                0x0000000C
#define _LCDDATA12_S12C3_MASK                    0x00001000
#define _LCDDATA12_S12C3_LENGTH                  0x00000001

#define _LCDDATA12_S13C3_POSITION                0x0000000D
#define _LCDDATA12_S13C3_MASK                    0x00002000
#define _LCDDATA12_S13C3_LENGTH                  0x00000001

#define _LCDDATA12_S14C3_POSITION                0x0000000E
#define _LCDDATA12_S14C3_MASK                    0x00004000
#define _LCDDATA12_S14C3_LENGTH                  0x00000001

#define _LCDDATA12_S15C3_POSITION                0x0000000F
#define _LCDDATA12_S15C3_MASK                    0x00008000
#define _LCDDATA12_S15C3_LENGTH                  0x00000001

#define _LCDDATA13_S16C3_POSITION                0x00000000
#define _LCDDATA13_S16C3_MASK                    0x00000001
#define _LCDDATA13_S16C3_LENGTH                  0x00000001

#define _LCDDATA13_S17C3_POSITION                0x00000001
#define _LCDDATA13_S17C3_MASK                    0x00000002
#define _LCDDATA13_S17C3_LENGTH                  0x00000001

#define _LCDDATA13_S18C3_POSITION                0x00000002
#define _LCDDATA13_S18C3_MASK                    0x00000004
#define _LCDDATA13_S18C3_LENGTH                  0x00000001

#define _LCDDATA13_S19C3_POSITION                0x00000003
#define _LCDDATA13_S19C3_MASK                    0x00000008
#define _LCDDATA13_S19C3_LENGTH                  0x00000001

#define _LCDDATA13_S20C3_POSITION                0x00000004
#define _LCDDATA13_S20C3_MASK                    0x00000010
#define _LCDDATA13_S20C3_LENGTH                  0x00000001

#define _LCDDATA13_S21C3_POSITION                0x00000005
#define _LCDDATA13_S21C3_MASK                    0x00000020
#define _LCDDATA13_S21C3_LENGTH                  0x00000001

#define _LCDDATA13_S22C3_POSITION                0x00000006
#define _LCDDATA13_S22C3_MASK                    0x00000040
#define _LCDDATA13_S22C3_LENGTH                  0x00000001

#define _LCDDATA13_S23C3_POSITION                0x00000007
#define _LCDDATA13_S23C3_MASK                    0x00000080
#define _LCDDATA13_S23C3_LENGTH                  0x00000001

#define _LCDDATA13_S24C3_POSITION                0x00000008
#define _LCDDATA13_S24C3_MASK                    0x00000100
#define _LCDDATA13_S24C3_LENGTH                  0x00000001

#define _LCDDATA13_S25C3_POSITION                0x00000009
#define _LCDDATA13_S25C3_MASK                    0x00000200
#define _LCDDATA13_S25C3_LENGTH                  0x00000001

#define _LCDDATA13_S26C3_POSITION                0x0000000A
#define _LCDDATA13_S26C3_MASK                    0x00000400
#define _LCDDATA13_S26C3_LENGTH                  0x00000001

#define _LCDDATA13_S27C3_POSITION                0x0000000B
#define _LCDDATA13_S27C3_MASK                    0x00000800
#define _LCDDATA13_S27C3_LENGTH                  0x00000001

#define _LCDDATA13_S30C3_POSITION                0x0000000E
#define _LCDDATA13_S30C3_MASK                    0x00004000
#define _LCDDATA13_S30C3_LENGTH                  0x00000001

#define _LCDDATA14_S47C3_POSITION                0x0000000F
#define _LCDDATA14_S47C3_MASK                    0x00008000
#define _LCDDATA14_S47C3_LENGTH                  0x00000001

#define _LCDDATA15_S48C3_POSITION                0x00000000
#define _LCDDATA15_S48C3_MASK                    0x00000001
#define _LCDDATA15_S48C3_LENGTH                  0x00000001

