MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GC006/mcu.h
#define _LCDDATA24_S08C6_POSITION                0x00000008
#define _LCDDATA24_S08C6_MASK                    0x00000100
#define _LCDDATA24_S08C6_LENGTH                  0x00000001

#define _LCDDATA24_S09C6_POSITION                0x00000009
#define _LCDDATA24_S09C6_MASK                    0x00000200
#define _LCDDATA24_S09C6_LENGTH                  0x00000001

#define _LCDDATA24_S10C6_POSITION                0x0000000A
#define _LCDDATA24_S10C6_MASK                    0x00000400
#define _LCDDATA24_S10C6_LENGTH                  0x00000001

#define _LCDDATA24_S11C6_POSITION                0x0000000B
#define _LCDDATA24_S11C6_MASK                    0x00000800
#define _LCDDATA24_S11C6_LENGTH                  0x00000001

#define _LCDDATA24_S12C6_POSITION                0x0000000C
#define _LCDDATA24_S12C6_MASK                    0x00001000
#define _LCDDATA24_S12C6_LENGTH                  0x00000001

#define _LCDDATA24_S13C6_POSITION                0x0000000D
#define _LCDDATA24_S13C6_MASK                    0x00002000
#define _LCDDATA24_S13C6_LENGTH                  0x00000001

#define _LCDDATA24_S14C6_POSITION                0x0000000E
#define _LCDDATA24_S14C6_MASK                    0x00004000
#define _LCDDATA24_S14C6_LENGTH                  0x00000001

#define _LCDDATA24_S15C6_POSITION                0x0000000F
#define _LCDDATA24_S15C6_MASK                    0x00008000
#define _LCDDATA24_S15C6_LENGTH                  0x00000001

#define _LCDDATA25_S16C6_POSITION                0x00000000
#define _LCDDATA25_S16C6_MASK                    0x00000001
#define _LCDDATA25_S16C6_LENGTH                  0x00000001

#define _LCDDATA25_S17C6_POSITION                0x00000001
#define _LCDDATA25_S17C6_MASK                    0x00000002
#define _LCDDATA25_S17C6_LENGTH                  0x00000001

#define _LCDDATA25_S18C6_POSITION                0x00000002
#define _LCDDATA25_S18C6_MASK                    0x00000004
#define _LCDDATA25_S18C6_LENGTH                  0x00000001

#define _LCDDATA25_S19C6_POSITION                0x00000003
#define _LCDDATA25_S19C6_MASK                    0x00000008
#define _LCDDATA25_S19C6_LENGTH                  0x00000001

#define _LCDDATA25_S20C6_POSITION                0x00000004
#define _LCDDATA25_S20C6_MASK                    0x00000010
#define _LCDDATA25_S20C6_LENGTH                  0x00000001

#define _LCDDATA25_S21C6_POSITION                0x00000005
#define _LCDDATA25_S21C6_MASK                    0x00000020
#define _LCDDATA25_S21C6_LENGTH                  0x00000001

#define _LCDDATA25_S22C6_POSITION                0x00000006
#define _LCDDATA25_S22C6_MASK                    0x00000040
#define _LCDDATA25_S22C6_LENGTH                  0x00000001

#define _LCDDATA25_S23C6_POSITION                0x00000007
#define _LCDDATA25_S23C6_MASK                    0x00000080
#define _LCDDATA25_S23C6_LENGTH                  0x00000001

#define _LCDDATA25_S24C6_POSITION                0x00000008
#define _LCDDATA25_S24C6_MASK                    0x00000100
#define _LCDDATA25_S24C6_LENGTH                  0x00000001

#define _LCDDATA25_S25C6_POSITION                0x00000009
#define _LCDDATA25_S25C6_MASK                    0x00000200
#define _LCDDATA25_S25C6_LENGTH                  0x00000001

#define _LCDDATA25_S26C6_POSITION                0x0000000A
#define _LCDDATA25_S26C6_MASK                    0x00000400
#define _LCDDATA25_S26C6_LENGTH                  0x00000001

#define _LCDDATA25_S27C6_POSITION                0x0000000B
#define _LCDDATA25_S27C6_MASK                    0x00000800
#define _LCDDATA25_S27C6_LENGTH                  0x00000001

#define _LCDDATA25_S30C6_POSITION                0x0000000E
#define _LCDDATA25_S30C6_MASK                    0x00004000
#define _LCDDATA25_S30C6_LENGTH                  0x00000001

#define _LCDDATA26_S47C6_POSITION                0x0000000F
#define _LCDDATA26_S47C6_MASK                    0x00008000
#define _LCDDATA26_S47C6_LENGTH                  0x00000001

#define _LCDDATA27_S48C6_POSITION                0x00000000
#define _LCDDATA27_S48C6_MASK                    0x00000001
#define _LCDDATA27_S48C6_LENGTH                  0x00000001

#define _LCDDATA27_S62C6_POSITION                0x0000000E
#define _LCDDATA27_S62C6_MASK                    0x00004000
#define _LCDDATA27_S62C6_LENGTH                  0x00000001

#define _LCDDATA28_S00C7_POSITION                0x00000000
#define _LCDDATA28_S00C7_MASK                    0x00000001
#define _LCDDATA28_S00C7_LENGTH                  0x00000001

#define _LCDDATA28_S01C7_POSITION                0x00000001
#define _LCDDATA28_S01C7_MASK                    0x00000002
#define _LCDDATA28_S01C7_LENGTH                  0x00000001

#define _LCDDATA28_S02C7_POSITION                0x00000002
#define _LCDDATA28_S02C7_MASK                    0x00000004
#define _LCDDATA28_S02C7_LENGTH                  0x00000001

#define _LCDDATA28_S03C7_POSITION                0x00000003
#define _LCDDATA28_S03C7_MASK                    0x00000008
#define _LCDDATA28_S03C7_LENGTH                  0x00000001

#define _LCDDATA28_S04C7_POSITION                0x00000004
#define _LCDDATA28_S04C7_MASK                    0x00000010
#define _LCDDATA28_S04C7_LENGTH                  0x00000001

#define _LCDDATA28_S05C7_POSITION                0x00000005
#define _LCDDATA28_S05C7_MASK                    0x00000020
#define _LCDDATA28_S05C7_LENGTH                  0x00000001

#define _LCDDATA28_S06C7_POSITION                0x00000006
#define _LCDDATA28_S06C7_MASK                    0x00000040
#define _LCDDATA28_S06C7_LENGTH                  0x00000001

#define _LCDDATA28_S07C7_POSITION                0x00000007
#define _LCDDATA28_S07C7_MASK                    0x00000080
#define _LCDDATA28_S07C7_LENGTH                  0x00000001

#define _LCDDATA28_S08C7_POSITION                0x00000008
#define _LCDDATA28_S08C7_MASK                    0x00000100
#define _LCDDATA28_S08C7_LENGTH                  0x00000001

#define _LCDDATA28_S09C7_POSITION                0x00000009
#define _LCDDATA28_S09C7_MASK                    0x00000200
#define _LCDDATA28_S09C7_LENGTH                  0x00000001

#define _LCDDATA28_S10C7_POSITION                0x0000000A
#define _LCDDATA28_S10C7_MASK                    0x00000400
#define _LCDDATA28_S10C7_LENGTH                  0x00000001

#define _LCDDATA28_S11C7_POSITION                0x0000000B
#define _LCDDATA28_S11C7_MASK                    0x00000800
#define _LCDDATA28_S11C7_LENGTH                  0x00000001

#define _LCDDATA28_S12C7_POSITION                0x0000000C
#define _LCDDATA28_S12C7_MASK                    0x00001000
#define _LCDDATA28_S12C7_LENGTH                  0x00000001

#define _LCDDATA28_S13C7_POSITION                0x0000000D
#define _LCDDATA28_S13C7_MASK                    0x00002000
#define _LCDDATA28_S13C7_LENGTH                  0x00000001

